define({
  "layersPage": {
    "allLayers": "כל השכבות",
    "title": "בחר תבנית בכדי ליצור ישויות",
    "generalSettings": "הגדרות כלליות",
    "layerSettings": "הגדרות שכבה",
    "presetValueText": "הגדר ערכים קבועים מראש",
    "geocoderSettingsText": "הגדרות הכלי לעיגון כתובות",
    "editDescription": "ספק טקסט תצוגה עבור חלונית העריכה",
    "editDescriptionTip": "טקסט זה מוצג מעל לבורר התבניות. אם אינך מעוניין להציג טקסט, השאר ריק.",
    "promptOnSave": "עם סגירת טופס או מעבר לרשומה הבאה, שאל אם לשמור פעולות עריכה שלא נשמרו.",
    "promptOnSaveTip": "הצג הודעה כאשר משתמש לוחץ לסגירה או מנווט לרשומה הבאה שניתנת לעריכה, אם בוצעו בישות הנוכחית פעולות עריכה שלא נשמרו.",
    "promptOnDelete": "בקש אישור בעת מחיקת רשומה.",
    "promptOnDeleteTip": "כאשר משתמש לוחץ למחיקה, בקש אישור לביצוע הפעולה.",
    "removeOnSave": "הסר ישות מהבחירה בעת שמירה.",
    "removeOnSaveTip": "אפשרות להסרת הישות מהבחירה שנקבעה בעת שמירת הרשומה. אם זו הרשומה היחידה שנבחרה, החלונית חוזרת לדף התבניות.",
    "useFilterEditor": "השתמש בפילטר של תבניות ישות",
    "useFilterEditorTip": "אפשרות להשתמש בבורר תבניות הסינון שמאפשר להציג תבנית של שכבה יחידה או לחפש תבניות לפי שם.",
    "displayShapeSelector": "הצג אפשרויות שרטוט",
    "displayShapeSelectorTip": "אפשרות להציג רשימה של אפשרויות שרטוט חוקיות עבור התבנית שנבחרה.",
    "displayPresetTop": "הצג רשימת ערכים קבועה מראש למעלה",
    "displayPresetTopTip": "אפשרות להציג רשימת ערכים קבועה מראש מעל לבורר התבניות.",
    "listenToGroupFilter": "החל ערכי מסננים מהווידג'ט 'מסנן קבוצתי' על השדות המוגדרים מראש",
    "listenToGroupFilterTip": "כאשר מסנן מיושם בווידג'ט 'מסנן קבוצתי', החל את הערך על שדה תואם ברשימת הערכים המוגדרים מראש.",
    "keepTemplateActive": "השאר את התבנית שנבחרה במצב פעיל",
    "keepTemplateActiveTip": "כאשר בורר התבניות מוצג, אם תבנית מסוימת נבחרה קודם לכן, בחר אותה מחדש.",
    "geometryEditDefault": "הפעל עריכת גיאומטריה כברירת מחדל",
    "autoSaveEdits": "השינויים נשמרים אוטומטית",
    "enableAttributeUpdates": "הצג לחצן לעדכון פעולות מאפיינים כאשר עריכת הגאומטריה פעילה",
    "layerSettingsTable": {
      "allowDelete": "אפשר מחיקה",
      "allowDeleteTip": "אפשרות להתיר למשתמש למחוק ישות; מושבת אם השכבה לא תומכת במחיקה",
      "edit": "ניתן לעריכה",
      "editTip": "אפשרות לכלול את השכבה בווידג'יט",
      "label": "שכבה",
      "labelTip": "שם השכבה כפי שמוגדר במפה",
      "update": "השבת עריכת גיאומטריה",
      "updateTip": "אפשרות להשבית את היכולת להזזת הגיאומטריה לאחר הצבתה, או להזזת הגיאומטריה בישות קיימת",
      "allowUpdateOnly": "עדכון בלבד",
      "allowUpdateOnlyTip": "אפשרות להתרת ביצוע פעולות של שינוי בלבד בישויות קיימות; מופעל כברירת מחדל ומושבת אם השכבה לא תומכת ביצירת תכונות חדשות",
      "fieldsTip": "שנה את השדות שמיועדים לעריכה, והגדר ישויות חכמות",
      "actionsTip": "אפשרות לעריכת שדות או לגישה אל שכבות/טבלאות קשורות",
      "description": "תאור",
      "descriptionTip": "אפשרות להזין טקסט שיוצג בחלק העליון של דף המאפיינים.",
      "relationTip": "הצג שכבות וטבלאות קשורות"
    },
    "editFieldError": "שינויים בשדות וישויות חכמות אינם זמינים בשכבות שלא ניתנות לעריכה",
    "noConfigedLayersError": "'עורך חכם' דורש שכבה ניתנת לעריכה אחת לפחות"
  },
  "editDescriptionPage": {
    "title": "הגדר טקסט סקירה כללית לישויות עבור <b>${layername}</b> "
  },
  "fieldsPage": {
    "title": "הגדר שדות עבור <b>${layername}</b>",
    "copyActionTip": "פעולות מאפיינים",
    "description": "השתמש בלחצן העריכה של הפעולות כדי להפעיל מאפיינים חכמים בשכבה. המאפיינים החכמים יכולים לדרוש, להסתיר או להשבית שדה על בסיס ערכים של שדות אחרים. השתמש בלחצן ההעתקה של הפעולות כדי להפעיל ולהגדיר את מקור הערך של שדה לפי צומת, כתובת, קואורדינטות וערך שנקבע מראש.",
    "fieldsNotes": "* מציין שדה חובה. אם אתה מבטל את הסימון להצגה עבור השדה הזה ותבנית העריכה לא משלימה את ערך השדה, לא תוכל לשמור רשומה חדשה.",
    "smartAttachmentText": "הגדר את הפעולה של תוספות חכמות",
    "smartAttachmentPopupTitle": "הגדר תוספות חכמות עבור <b>${layername}</b>",
    "fieldsSettingsTable": {
      "display": "תצוגה",
      "displayTip": "קבע אם השדה אינו נראה",
      "edit": "ניתן לעריכה",
      "editTip": "הפעל אם השדה קיים בטופס המאפיינים",
      "fieldName": "שם",
      "fieldNameTip": "שם השדה מוגדר במסד הנתונים",
      "fieldAlias": "כינוי",
      "fieldAliasTip": "שם השדה מוגדר במפה",
      "canPresetValue": "קבוע מראש",
      "canPresetValueTip": "אפשרות להצגת השדה ברשימת השדות המתוכנתים, ולהתיר למשתמש להגדיר ערך לפני העריכה",
      "actions": "פעולות",
      "actionsTip": "שנה את סדר השדות או הגדר מאפיינים חכמים"
    },
    "smartAttSupport": "מאפיינים חכמים לא נתמכים בשדות חובה של מסדי נתונים"
  },
  "actionPage": {
    "title": "הגדר את פעולות המאפיינים עבור <b>${fieldname}</b>",
    "description": "הפעולות תמיד מושבתות, למעט אם אתה מציין את הקריטריונים להפעלתן. הפעולות מעובדות לפי הסדר ורק פעולה אחת תופעל לכל שדה. השתמש בלחצן 'עריכת קריטריונים' להגדרת הקריטריונים.",
    "actionsSettingsTable": {
      "rule": "פעולה",
      "ruleTip": "הפעולה מתבצעת כשהקריטריונים מתמלאים",
      "expression": "ביטוי",
      "expressionTip": "הביטוי שמתקבל בפורמט SQL מהקריטריונים שהוגדרו",
      "actions": "קריטריונים",
      "actionsTip": "שנה את סדר הכלל והגדר את הקריטריונים להפעלתו"
    },
    "copyAction": {
      "description": "המקורות של ערכי השדות עוברים עיבוד לפי הסדר, אם הם מופעלים, עד שקריטריון חוקי מתמלא או עד שהמערכת מגיע לסוף הרשימה. השתמש בלחצן העריכה של הקריטריונים כדי להגדיר את הקריטריונים.",
      "intersection": "חיתוך",
      "coordinates": "קואורדינטות",
      "address": "כתובת",
      "preset": "קבוע מראש",
      "actionText": "פעולות",
      "criteriaText": "קריטריונים",
      "enableText": "מאופשר"
    },
    "actions": {
      "hide": "הסתר",
      "required": "נדרש",
      "disabled": "לא פעיל"
    }
  },
  "filterPage": {
    "submitHidden": "לשלוח את נתוני המאפיינים עבור שדה זה גם אם הם מוסתרים?",
    "title": "הגדר ביטוי עבור החוק ${action}",
    "filterBuilder": "הגדר פעולה בשדה כאשר הרשומה תואמת ל-${any_or_all} מהביטויים הבאים",
    "noFilterTip": "באמצעות הכלים שלהלן, הגדר את ההצהרה ליישום הפעולה."
  },
  "geocoderPage": {
    "setGeocoderURL": "הגדר URL של מעגן הכתובות",
    "hintMsg": "הערה: אתה מבצע שינוי בשירות של הכלי לעיגון כתובות. הקפד לעדכן את כל מיפויי השדות שהגדרת בכלי לעיגון כתובות.",
    "invalidUrlTip": "ה-URL ‏${URL} שגוי או אינו נגיש."
  },
  "addressPage": {
    "popupTitle": "כתובת",
    "checkboxLabel": "קבל ערך מהכלי לעיגון כתובות",
    "selectFieldTitle": "מאפיין:",
    "geocoderHint": "כדי לבצע שינויים בכלי לעיגון כתובות, לחץ על הלחצן 'הגדרות הכלי לעיגון כתובות' בהגדרות הכלליות"
  },
  "coordinatesPage": {
    "popupTitle": "קואורדינטות",
    "checkboxLabel": "קבל קואורדינטות",
    "coordinatesSelectTitle": "מערכת קואורדינטות:",
    "coordinatesAttributeTitle": "מאפיין:",
    "mapSpatialReference": "ייחוס מרחבי של מפה",
    "latlong": "קו רוחב/אורך"
  },
  "presetPage": {
    "popupTitle": "קבוע מראש",
    "checkboxLabel": "השדה ייקבע מראש",
    "presetValueLabel": "הערך הנוכחי הקבוע מראש הוא:",
    "changePresetValueHint": "כדי לשנות ערך זה שנקבע מראש, עבור אל 'הגדר ערכים קבועים מראש' בהגדרות הכלליות"
  },
  "intersectionPage": {
    "checkboxLabel": "קבל ערך מהשדה של שכבת הצמתים",
    "layerText": "שכבות",
    "fieldText": "שדות",
    "actionsText": "פעולות",
    "addLayerLinkText": "הוסף שכבה"
  },
  "presetAll": {
    "popupTitle": "הגדר את ערכי ברירת המחדל הקבועים מראש",
    "deleteTitle": "מחק ערך קבוע מראש",
    "hintMsg": "כל השמות הייחודיים של שדות קבועים מראש מופיעים כאן. הסרה של שדה קבוע מראש תביא להשבתת השדה התואם כערך קבוע מראש בכל השכבות/הטבלאות."
  }
});