define({
  "layersPage": {
    "allLayers": "جميع الطبقات",
    "title": "تحديد قالب لإنشاء المعالم",
    "generalSettings": "إعدادات عامة",
    "layerSettings": "إعدادات الطبقة",
    "presetValueText": "تحديد قيم معينة مسبقًا",
    "geocoderSettingsText": "إعداد المُكوِّد الجغرافي",
    "editDescription": "توفير عرض النص للوحة التحرير",
    "editDescriptionTip": "يتم عرض النص أعلى منتقى القالب، اتركه فارغًا لعدم وجود نص.",
    "promptOnSave": "يتم توجيهك لحفظ التحريرات غير المحفوظة عند غلق النموذج أو تحويله إلى السجل التالي.",
    "promptOnSaveTip": "يتم عرض رسالة توجيهية عندما ينقر المستخدم على إغلاق أو ينتقل إلى السجل التالي القابل للتحرير عندما يحتوي المعلم الحالي على تحريرات غير محفوظة.",
    "promptOnDelete": "يتطلب تأكيد عند حذف سجل.",
    "promptOnDeleteTip": "عرض طلب عندما ينقر المستخدم على حذف لتأكيد الإجراء.",
    "removeOnSave": "إزالة المعالم من التحديد عند الحفظ.",
    "removeOnSaveTip": "هو خيار لإزالة المعلم من مجموعة التحديد عند حفظ السجل. وإذا كان عبارة عن السجل المحدد فقط، فإن اللوحة تعود إلى صفحة القالب.",
    "useFilterEditor": "استخدم عامل تصفية قالب المعلم",
    "useFilterEditorTip": "خيار لاستخدام منقى قالب التصفية الذي يوفر القدرة على عرض أحد قوالب الطبقة أو البحث عن القوالب باستخدام الاسم.",
    "displayShapeSelector": "إظهار خيارات الرسم",
    "displayShapeSelectorTip": "خيار عرض قائمة من خيارات الرسم الصحيحة للقالب المحدد.",
    "displayPresetTop": "عرض قائمة قيم معينة مسبقًا في المقدمة",
    "displayPresetTopTip": "خيار عرض قائمة القيم المعينة مُسبقًا أعلى أداة اختيار القالب.",
    "listenToGroupFilter": "تطبيق قيم التصفية من عنصر واجهة استخدام \"عامل تصفية المجموعة\" على الحقول المُعدة مُسبقًا",
    "listenToGroupFilterTip": "عند تطبيق عامل التصفية في عنصر واجهة استخدام \"عامل تصفية المجموعة\"، قم بتطبيق القيمة على الحقل المطابق في قائمة القيمة المُعدة مُسبقًا.",
    "keepTemplateActive": "اجعل القالب المحدد نشطًا",
    "keepTemplateActiveTip": "عند إظهار منتقى القالب، وإذا تم تحديد القالب مُسبقًا، قم بإعادة تحديده مرة أخرى.",
    "geometryEditDefault": "تمكين تحرير الشكل الهندسي افتراضيًا",
    "autoSaveEdits": "حفظ التحرير تلقائيًا",
    "enableAttributeUpdates": "عرض زر تحديث إجراءات جدول البيانات عندما يكون تحرير الشكل الهندسي نشطًا",
    "layerSettingsTable": {
      "allowDelete": "السماح بالحذف",
      "allowDeleteTip": "هو خيار للسماح للمستخدم بحذف معلم؛ ويتم تعطيله إذا كانت الطبقة لا تدعم الحذف.",
      "edit": "يمكن تحريره",
      "editTip": "هو خيار لتضمين الطبقة في عنصر واجهة المستخدم",
      "label": "الطبقة",
      "labelTip": "اسم الطبقة كما هو محدد في الخريطة",
      "update": "تعطيل تحرير الشكل الهندسي",
      "updateTip": "هو خيار لتعطيل القدرة على نقل الشكل الهندسي عند وضعه أو نقل الشكل الهندسية على معلم موجود",
      "allowUpdateOnly": "تحديث فقط",
      "allowUpdateOnlyTip": "خيار للسماح فقط بتعديل المعالم الحالية، والتحقق منها افتراضيًا، وتعطيلها إذا كانت الطبقة لا تدعم عملية إنشاء معالم جديدة",
      "fieldsTip": "تعديل الحقول ليتم تحريرها وتعريف البيانات الجدولية الذكية",
      "actionsTip": "خيارات تحرير الحقول أو الوصول إلى الجداول/الطبقات ذات الصلة",
      "description": "الوصف",
      "descriptionTip": "خيار لإدخال نص لعرضه أعلى صفحة البيانات الجدولية.",
      "relationTip": "عرض الطبقات والجداول ذات الصلة"
    },
    "editFieldError": "لم تتوفر خاصية تعديلات الحقل والبيانات الجدولية الذكية للطبقات التي لا يمكن تحريرها",
    "noConfigedLayersError": "يتطلب المحرر الذكي طبقة واحدة أو مزيد من الطبقات القابلة للتحرير"
  },
  "editDescriptionPage": {
    "title": "نص النظرة العامة على تعريف البيانات الجدولية الخاص بـ <b>${layername}</b> "
  },
  "fieldsPage": {
    "title": "تكوين الحقول لـ <b>${layername}</b>",
    "copyActionTip": "إجراءات جدول البيانات",
    "description": "استخدم زر تحرير الإجراءات لتنشيط جداول البيانات الذكية في الطبقة، وقد تتطلب جداول بيانات الطبقة الحقل أو تقوم بإخفاؤه أو تعطيله بناءً على القيم في الحقول الأخرى. استخدم زر نسخ الإجراءات لتنشيط وتحديد مصدر قيمة الحقل بواسطة التقاطع والعنوان والإحداثيات والتعيين المسبق.",
    "fieldsNotes": "* تعتبر حقل إلزامي. إذا قمت بإلغاء تحديد العرض لهذا الحقل وأن قالب التحرير لا يقوم بتعبئة قيمة الحقل، فلن تكون قادرًا على حفظ سجل جديد.",
    "smartAttachmentText": "تكوين إجراء \"المرفقات\" الذكي",
    "smartAttachmentPopupTitle": "تكوين المرفقات الذكية من أجل <b>${layername}</b>",
    "fieldsSettingsTable": {
      "display": "العرض",
      "displayTip": "تحديد ما إذا يكون الحقل مرئي أم لا",
      "edit": "يمكن تحريره",
      "editTip": "التحقق مما إذا كان الحقل موجود في نموذج البيانات الجدولية أم لا",
      "fieldName": "الاسم",
      "fieldNameTip": "اسم الحقل المعرف في قاعدة البيانات",
      "fieldAlias": "الاسم المستعار",
      "fieldAliasTip": "اسم الحقل المعرف في الخريطة",
      "canPresetValue": "تعيين مسبق",
      "canPresetValueTip": "هو خيار لإظهار الحقل في قائمة الحقل التي تم تعيينها مُسبقًا والسماح للمستخدم بتعيين القيمة قبل عملية التحرير",
      "actions": "إجراءات",
      "actionsTip": "تغيير ترتيب الحقول أو إعداد البينات الجدولية الذكية"
    },
    "smartAttSupport": "لا تدعم البيانات الجدولية الذكية حقول قاعدة البيانات المطلوبة"
  },
  "actionPage": {
    "title": "تكوين إجراءات جدول البيانات لـ <b>${fieldname}</b>",
    "description": "دائمًا ما تكون الإجراءات غير مُفعلة مالم تحدد المعيار الذي يتم تشغيله عليها. تتم معالجة الإجراءات في ترتيب وسيتم تشغيل إجراء واحد فقط لكل حقل. ويمكنك استخدام زر تحرير المعيار لتحديد المعيار.",
    "actionsSettingsTable": {
      "rule": "إجراء",
      "ruleTip": "الإجراء الذي تم تنفيذخ عند استيفاء المعيار",
      "expression": "تعبير",
      "expressionTip": "التعبير الناتج في تنسيق SQL من المعيار المحدد",
      "actions": "معيار",
      "actionsTip": "تغيير ترتيب القاعدة وتحديد المعيار عند تشغيله"
    },
    "copyAction": {
      "description": "تتم معالجة مصدر قيمة الحقل بالترتيب إذا تم تنشيطه حتى يتم تشغيل معيار صحيح أو اكتمال القائمة. استخدم زر \"تحرير المعيار\" لتحديد المعيار.",
      "intersection": "تقاطع",
      "coordinates": "إحداثيات",
      "address": "عنوان",
      "preset": "تعيين مُسبق",
      "actionText": "إجراءات",
      "criteriaText": "معيار",
      "enableText": "تم التمكين"
    },
    "actions": {
      "hide": "إخفاء",
      "required": "مطلوب",
      "disabled": "معطل"
    }
  },
  "filterPage": {
    "submitHidden": "هل تم إرسال البيانات الجدولية لهذا الحقل حتى عند الإخفاء؟",
    "title": "عبارة التكوين الخاصة بقاعدة ${action}",
    "filterBuilder": "قم بتعيين إجراء على الحقل عند مطابقة السجل ${any_or_all} للتعبيرات التالية",
    "noFilterTip": "عند استخدام الأدوات التالية، قم بتحديد العبارة الخاصة بالإجراء عندما تكون نشطة."
  },
  "geocoderPage": {
    "setGeocoderURL": "تحديد عنوان URL للمكود الجغرافي",
    "hintMsg": "ملحوظة: أنت تقوم بتغيير خدمة المُكوِّد الجغرافي، يرجى التأكد من تحدي أي عمليات تخطيط لحقل المكود الجغرافي الذي قمت بتكوينه.",
    "invalidUrlTip": "عنوان URL لـ ${URL} غير صحيح أو لا يمكن الوصول إليه."
  },
  "addressPage": {
    "popupTitle": "عنوان",
    "checkboxLabel": "الحصول على قيمة من المكود الجغرافي",
    "selectFieldTitle": "البيانات الجدولية:",
    "geocoderHint": "لتغيير المكود الجغرافي، انتقل إلى زر 'إعدادات المكود الجغرافي' في الإعدادات العامة."
  },
  "coordinatesPage": {
    "popupTitle": "إحداثيات",
    "checkboxLabel": "الحصول على الإحداثيات",
    "coordinatesSelectTitle": "نظام الإحداثيات:",
    "coordinatesAttributeTitle": "البيانات الجدولية:",
    "mapSpatialReference": "الإسناد المكاني للخريطة",
    "latlong": "دائرة العرض/خط الطول"
  },
  "presetPage": {
    "popupTitle": "تعيين مُسبق",
    "checkboxLabel": "سيتم تعيين الحقل مُسبقًا",
    "presetValueLabel": "القيمة الحالية المعينة مسبقًا هي:",
    "changePresetValueHint": "لتغيير هذه القيمة التي تم تعيينها مسبقًا، انتقل إلى زر 'تحديد القيم المعينة مُسبقًا' في الإعدادات العامة"
  },
  "intersectionPage": {
    "checkboxLabel": "الحصول على قيمة من حقل طبقة التقاطع",
    "layerText": "الطبقات",
    "fieldText": "حقول",
    "actionsText": "إجراءات",
    "addLayerLinkText": "إضافة طبقة"
  },
  "presetAll": {
    "popupTitle": "تحديد القيم الافتراضية المعينة مسبقًا",
    "deleteTitle": "حذف قيمة معينة مسبقًا",
    "hintMsg": "ستجد هنا كل أسماء الحقول الفريدة المعينة مسبقًا، وعند إزالة الحقل المُعين مسبقًا، سيتم تعطيل الحقل الخاص بكل اسم كما تم تعيينه مسبقًا من كل الطبقات/الجداول."
  }
});