define({
  "allowSaveAs": "エクスポートの許可",
  "startingState": "開始状態:",
  "byUrl": "空のモデル",
  "byItem": "事前に構成されたモデル",
  "imageServiceUrl": "イメージ サービスの URL",
  "validate": "整合チェック",
  "validating": "整合チェックしています...",
  "validated": "URL は有効です。",
  "modelName": "モデル",
  "selectModel": "選択",
  "itemSelectorTitle": "モデルの選択",
  "ok": "OK",
  "cancel": "キャンセル",
  "description1": "適合性モデラーは、アクティビティに最適な場所の検索、危険性の予測、事象が発生する可能性が高い場所の識別に役立ちます。 このウィジェットを使用すると、さまざまなレイヤーを組み合わせて重み付けし、複数のファクターを一度に評価できます。",
  "description2": "適合性モデラーは、高速な Web ベースの加重ラスター オーバーレイを使用して、サービスからモデルを生成します。 空の状態の加重ラスター オーバーレイ (WRO) サービスまたは事前に構成された WRO モデルから開始できます。 レイヤーを選択し、ウェイトを割り当て、レイヤーの分類値を調整して、解析を定義します。 次に、モデラーを実行し、結果を視覚化して、必要に応じて結果をアイテムとして組織/ポータルに保存します。",
  "description3": "GeoPlanner 適合性モデラーの詳細"
});