define({
  "styleText": "स्वाइप टूल के लिए कोई शैली चुनें",
  "vertical": "वर्टीकल बार",
  "horizontal": "क्षैतिज बार",
  "scope": "स्पाईग्लास",
  "barColor": "बार रंग",
  "layerText": "वह लेयर चुनें जो आप डिफ़ॉल्ट रूप से स्वाइप करना चाहते हैं",
  "spyglassText": "वह लेयर चुनें जो डिफ़ॉल्ट रूप से स्पाईग्लास के भीतर प्रदर्शित हो।",
  "layerHint": "नोट: यदि लेयर ऊपरी लेयरों द्वारा छिपी हुई है, तो स्वाइप का कोई प्रभाव नहीं होगा।",
  "isZoom": "लेयर स्वाइप करने हेतु ज़ूम करें",
  "layersAvailable": "किस लेयर को स्वाइप करना हैं चुनें:"
});