define({
  "allowSaveAs": "내보내기 허용",
  "startingState": "시작 상태:",
  "byUrl": "빈 모델",
  "byItem": "미리 구성된 모델",
  "imageServiceUrl": "이미지 서비스 URL",
  "validate": "유효성 검사",
  "validating": "유효성 검사 중...",
  "validated": "URL이 유효합니다.",
  "modelName": "모델",
  "selectModel": "선택",
  "itemSelectorTitle": "모델 선택",
  "ok": "확인",
  "cancel": "취소",
  "description1": "적합성 모델러를 사용하면 활동을 위한 최적의 위치를 찾거나, 위험 발생 가능성을 예측하거나, 특정 상황이 발생할 수 있는 위치를 식별할 수 있습니다. 이 위젯에서는 서로 다른 여러 레이어를 결합하고 가중치를 적용해 여러 인자를 한 번에 평가할 수 있습니다.",
  "description2": "적합성 모델러는 웹 기반 고속 가중치 래스터 중첩을 사용하여 서비스에서 모델을 생성합니다. WRO(가중치 래스터 중첩) 서비스가 비어 있는 상태에서 시작할 수도 있고, 미리 구성된 WRO 모델을 사용할 수도 있습니다. 레이어를 선택하고 가중치를 할당한 다음, 레이어 분류 값을 조정하여 분석을 정의합니다. 그런 후에 모델러를 실행하고 결과를 시각화하고, 필요에 따라 기관/포털에서 결과를 항목으로 저장합니다.",
  "description3": "GeoPlanner 적합성 모델러에 대해 자세히 알아보세요."
});