define({
  "allowSaveAs": "Δυνατότητα εξαγωγής",
  "startingState": "Κατάσταση έναρξης:",
  "byUrl": "Κενό μοντέλο",
  "byItem": "Προδιαμορφωμένο μοντέλο",
  "imageServiceUrl": "Image Service URL",
  "validate": "Επικύρωση",
  "validating": "Επικύρωση...",
  "validated": "Το URL είναι έγκυρο.",
  "modelName": "Μοντέλο",
  "selectModel": "Επιλογή",
  "itemSelectorTitle": "Επιλογή μοντέλου",
  "ok": "ΟΚ",
  "cancel": "Ακύρωση",
  "description1": "Ο Σχεδιαστής καταλληλότητας σας βοηθά να βρείτε την καλύτερη τοποθεσία για μια δραστηριότητα, να προβλέψετε την ευπάθεια σε κίνδυνο, ή να προσδιορίσετε πού μπορεί να συμβεί κάτι. Με αυτό το widget μπορείτε να συνδυάσετε και να σταθμίσετε διάφορα θεματικά επίπεδα, ώστε να αξιολογήσετε ταυτόχρονα πολλούς παράγοντες.",
  "description2": "Ο Σχεδιαστής καταλληλότητας χρησιμοποιεί γρήγορο Weighted Raster Overlay που βασίζεται στο web για τη δημιουργία μοντέλων από ένα service. Μπορείτε να ξεκινήσετε από κενή κατάσταση ενός Weight Raster Overlay (WRO) Service ή από ένα προδιαμορφωμένο μοντέλο WRO. Επιλέξτε θεματικά επίπεδα, αντιστοιχίστε δείκτες στάθμισης και προσαρμόστε τις τιμές κατάταξης του θεματικού επιπέδου, για να ορίσετε την ανάλυσή σας. Στη συνέχεια, θέστε σε λειτουργία το modeler, οπτικοποιήστε τα αποτελέσματα και, προαιρετικά, αποθηκεύστε το αποτέλεσμα ως αντικείμενο στον οργανισμό/στην πύλη σας.",
  "description3": "Περισσότερες πληροφορίες για το GeoPlanner suitability modeler."
});