define({
  "default": {
    "name": "ברירת מחדל",
    "description": "ברירת מחדל"
  },
  "editor": {
    "name": "עריכה",
    "description": "ערוך וצור ישויות בשכבות הניתנות לעריכה ב-Web Map. "
  },
  "basic_viewer": {
    "name": "נקודת האפס",
    "description": "כולל כמה ווידג'טים כלליים המאפשרים לך להציג את המפה ולקיים אתה אינטראקציה."
  },
  "simple_map_viewer": {
    "name": "Maplet",
    "description": "מספק חוויית משתמש פשוטה לבחינת מפות Web Map."
  },
  "infographic_dashboard": {
    "name": "לוח מחוונים אינפוגרפי (אפליקציה לדוגמה) ",
    "description": "דוגמה לאפליקציה של לוח מחוונים המציגה את יכולות ערכת הנושא של לוח המחוונים  ושל הווידג'טים של אינפוגרפיקה."
  }
});