define({
  "styleText": "Выберите стиль инструмента Шторка",
  "vertical": "Вертикальная шторка",
  "horizontal": "Горизонтальная шторка",
  "scope": "Увеличительное стекло",
  "barColor": "Цвет линейки",
  "layerText": "Выберите слой, который хотите спрятать по умолчанию",
  "spyglassText": "Выберите слой, который будет отображаться через увеличительное стекло по умолчанию.",
  "layerHint": "Примечание: Если слой скрыт верхними слоями, шторка ничего не делает.",
  "isZoom": "Приблизить к слою-шторке",
  "layersAvailable": "Выбрать, какой слой будет скрываться:"
});