define({
  "_widgetLabel": "Εργαλείο προβολής πλάγιων λήψεων",
  "locateButtonLabel": "Επιλέξτε ένα σημείο στον κύριο χάρτη για προβολή πλάγιων λήψεων.",
  "clearButtonLabel": "Απαλοιφή όλων των γραφικών",
  "zoomButtonLabel": "Εστίαση στην έκταση πλάγιων λήψεων",
  "syncButtonLabel": "Συγχρονισμός χάρτη ναδίρ",
  "rasterListLabel": "Προβολή διαθέσιμων πλάγιων λήψεων",
  "measureWidgetLabel": "Επιλογές μέτρησης",
  "intialScaleLabel": "Επιλέξτε την αρχική κλίμακα για προβολή πλάγιων λήψεων",
  "smallBuildingLabel": "Αστική περιοχή: Μικρό κτίριο",
  "buildingLabel": "Αστική περιοχή: Κτίριο",
  "azimuthChangeNotification": "Δεν υπάρχουν δεδομένα στην επιλεγμένη κατεύθυνση.",
  "noImageNotification": "Σε αυτή την περιοχή δεν υπάρχουν εικόνες. Επιλέξτε μια άλλη τοποθεσία στον κύριο χάρτη."
});