define({
  "_widgetLabel": "Ανάλυση",
  "executeAnalysisTip": "Κάντε κλικ σε ένα εργαλείο ανάλυσης για εκτέλεση",
  "noToolTip": "Δεν έχει διαμορφωθεί εργαλείο ανάλυσης!",
  "jobSubmitted": "υποβλήθηκε.",
  "jobCancelled": "Ακυρώθηκε.",
  "jobFailed": "Αποτυχία",
  "jobSuccess": "Επιτυχία.",
  "executing": "Εκτέλεση",
  "cancelJob": "Ακύρωση της εργασίας ανάλυσης",
  "paramName": "Όνομα παραμέτρου",
  "learnMore": "Μάθετε περισσότερα",
  "outputtip": "Σημείωση: Οι έξοδοι στοιχείων και πινάκων προστίθενται στο χάρτη ως επιχειρησιακά θεματικά επίπεδα.",
  "outputSaveInPortal": "Τα δεδομένα έχουν αποθηκευτεί στην πύλη σας.",
  "privilegeError": "Ο ρόλος χρήστη σας δεν μπορεί να εκτελέσει ανάλυση. Για να εκτελεστεί ανάλυση, ο διαχειριστής του οργανισμού σας πρέπει να σας εκχωρήσει ορισμένα <a href=\"http://doc.arcgis.com/en/arcgis-online/reference/roles.htm\" target=\"_blank\">δικαιώματα</a>.",
  "noServiceError": "Δεν υπάρχουν διαθέσιμες υπηρεσίες χωρικής ανάλυσης. Ελέγξτε τις παραμετροποιήσεις του portal σας."
});