define({
  "allowSaveAs": "السماح بالتصدير",
  "startingState": "تاريخ البدء:",
  "byUrl": "نموذج فارغ",
  "byItem": "نموذج تم تكوينه مسبقًا",
  "imageServiceUrl": "عنوان URL لخدمة الصورة",
  "validate": "تدقيق",
  "validating": "جار التحقق...",
  "validated": "عنوان URL غير صحيح.",
  "modelName": "النموذج",
  "selectModel": "تحديد",
  "itemSelectorTitle": "حدد نموذج",
  "ok": "موافق",
  "cancel": "إلغاء الأمر",
  "description1": "يساعد العارض الملائم في العثور على أفضل موقع للنشاط، وتوقع الإحساس بالمخاطر، أو تحديد موقع حدوث شيء ما محتمل. يتيح عنصر واجهة الاستخدام الحالي بتجميع الطبقات المختلفة وكثافتها وبالتالي يمكن تقييم العوامل المتعددة في الحال.",
  "description2": "يستخدم العارض الملائم تراكب بيانات نقطية مرجحة سريعة تستند إلى الويب لإنشاء نماذج من خدمة. يمكنك البدء من حالة فارغة لخدمة تراكب البيانات النقطية المرجحة (WRO أو نموذح WRO تم تكوينه مسبقًا. اختر الطبقات، وقم بتعيين الكثافات واضبط قيم تصنيف الطبقة لتحديد التحليل. ثم ثم بتشغيل العارض، وتصور النتائج، واحفظ النتيجة اختياريًا في صورة عنصر في المؤسسة/البوابة الإلكترونية.",
  "description3": "تعلم المزيد عن عارض GeoPlanner الملائم."
});