define({
  "showLayerLabels": "Παρουσίαση ονομάτων θεματικών επιπέδων στο widget με χρονικές πληροφορίες",
  "autoPlay": "Αυτόματη αναπαραγωγή της μπάρας κύλισης",
  "dateAndTimeFormat": "Μορφή ημερομηνίας και ώρας",
  "mapDefault": "Προεπιλεγμένος χάρτης",
  "custom": "Προσαρμοσμένο",
  "formatInstruction": "Οδηγία μορφοποίησης",
  "playback": "θέση αναπαραγωγής που αποθηκεύτηκε στον χάρτη",
  "MMMMYYYY": "Ιούλιος 2015",
  "MMMYYYY": "Ιούλ. 2015",
  "MMMMDYYYY": "21 Ιουλίου 2015",
  "dddMMMDDYYYY": "Τρίτη 21 Ιούλ. 2015",
  "MDDYYYY": "21/7/2015",
  "YYYYMDD": "21/7/2015",
  "MDDYY": "21/7/2015",
  "YYYY": "2015",
  "MDDYYYYhmma": "21/7/2015, 8:00 π.μ.",
  "dddMMMDDhmma": "Τρίτη 21 Ιούλ., 8:00 π.μ."
});