define({
  "layersPage": {
    "allLayers": "ชั้นข้อมูลทั้งหมด",
    "title": "เลือกเทมเพลตเพื่อสร้างฟีเจอร์",
    "generalSettings": "ตั้งค่าทั่วไป",
    "layerSettings": "การตั้งค่าชั้นข้อมูล",
    "presetValueText": "กำหนดค่าที่กำหนดไว้ล่วงหน้า",
    "geocoderSettingsText": "การตั้งค่าตัวระบุรหัสพิกัดทางภูมิศาสตร์",
    "editDescription": "ให้แสดงข้อความสำหรับพาเนลที่แก้ไข",
    "editDescriptionTip": "ข้อความนี้จะปรากฏเหนือเทมเพลต ให้ปล่อยว่างไว้สำหรับข้อความใดๆ",
    "promptOnSave": "พร้อมที่จะบันทึกการแก้ไขไม่ได้บันทึกไว้เมื่อฟอร์มถูกปิดหรือเปลี่ยนไประเบียนถัดไป",
    "promptOnSaveTip": "แสดงการแจ้งเตือนเมื่อผู้ใช้คลิกปิดหรือนำทางไปยังเรคคอร์ทที่สามารถแก้ไขได้ต่อไป เมื่อฟีเจอร์ปัจจุบันมีการแก้ไขที่ไม่ได้บันทึก",
    "promptOnDelete": "ต้องการการยืนยันเมื่อลบเรคคอร์ท",
    "promptOnDeleteTip": "แสดงข้อความแจ้งเมื่อผู้ใช้คลิกลบเพื่อยืนยันการดำเนินการ",
    "removeOnSave": "ลบฟีเจอร์จากที่เลือกไว้เมื่อบันทึก",
    "removeOnSaveTip": "ตัวเลือกในการลบฟีเจอร์จากการตั้งค่าตัวเลือกจะถูกบันทึกไว้ ถ้ามันเป็นเพียงบันทึกการเลือกเรคคอร์ท พาเนลจะเปลี่ยนกลับไปที่หน้าเทมเพลต",
    "useFilterEditor": "ใช้ตัวกรองฟีเจอร์เทมเพลต",
    "useFilterEditorTip": "ตัวเลือกในการใช้ตัวเลือกแม่แบบตัวกรองซึ่งให้ความสามารถในการดูแม่แบบของหนึ่งชั้นข้อมูลหรือค้นหาแม่แบบตามชื่อ",
    "displayShapeSelector": "แสดงตัวเลือกการวาดภาพ",
    "displayShapeSelectorTip": "ตัวเลือกเพื่อแสดงรายการการวาดภาพที่ถูกต้องสำหรับเทมเพลตที่เลือก",
    "displayPresetTop": "แสดงค่าที่ตั้งไว้ล่วงหน้าที่ด้านบน",
    "displayPresetTopTip": "ตัวเลือกเพื่อแสดงรายการค่าที่ตั้งล่วงหน้าไว้เหนือตัวเลือกเทมเพลต",
    "listenToGroupFilter": "ปรับใช้ค่าการกรองจากกลุ่มวิดเจ็ตตัวกรองไปยังฟิลด์ที่ตั้งไว้ล่วงหน้า",
    "listenToGroupFilterTip": "เมื่อตัวกรองถูกใช้กับหลุ่มวิดเจ็ตตัวกรอง ใช้ค่าที่สอดต้องกับฟิลด์ในลิสต์ที่เตรียมไว้ล่วงหน้า",
    "keepTemplateActive": "ทำให้เท็มเพลตที่เลือกใช้งานได้",
    "keepTemplateActiveTip": "เมื่อเท็มเพลตที่เลือกถูกแสดงขึ้น หากมีการเลือกเท็มเพลตไว้ ให้เลือกอีกครั้งหนึ่ง",
    "geometryEditDefault": "เปิดใช้งานการแก้ไขรูปทรงเรขาคณิตโดยค่าเริ่มต้น",
    "autoSaveEdits": "บันทึกการแก้ไขโดยอัตโนมัติ",
    "enableAttributeUpdates": "แสดงปุ่มการอัปเดตการดำเนินการของแอ็ตทริบิวต์เมื่อใช้งานการแก้ไขเรขาคณิต",
    "layerSettingsTable": {
      "allowDelete": "อนุญาตให้ลบ",
      "allowDeleteTip": "ตัวเลือกเพื่ออนุญาตให้ผู้ใช้ลบฟีเจอร์  ไม่สามารถใช้งานได้หากชั้นข้อมูลไม่รองรับการลบ",
      "edit": "ที่สามารถแก้ไขได้",
      "editTip": "ตัวเลือกเพื่อรวมชั้นข้อมูลในวิดเจต",
      "label": "ชั้นข้อมูล",
      "labelTip": "ชื่อของชั้นข้อมูลเหมือนที่ระบุในแผนที่",
      "update": "ไม่สามารถใช้งานการแก้ไขด้านเรขาคณิตได้",
      "updateTip": "ตัวเลือกเพื่อที่จะปิดการใช้งานความสามารถในการย้ายคุณสมบัติเรขาคณิตที่วางอยู่ หรือย้ายคุณสมบัติทางเรขาคณิตในฟีเจอร์ที่มีอยู่",
      "allowUpdateOnly": "เฉพาะการอัพเดทเท่านั้น",
      "allowUpdateOnlyTip": "ตัวเลือกในการอนุญาตให้แก้ไขเฉพาะฟีเจอร์ที่มีอยู่เท่านั้น โดยค่าเริ่มต้นจะเปิดใช้งาน แต่จะปิดใช้งานหากชั้นข้อมูลนั้นไม่รองรับการสร้างฟีเจอร์ใหม่",
      "fieldsTip": "การปรับฟิลด์ให้แก้ไข และกำหนดสมาร์ทแอตทริบิวต์",
      "actionsTip": "ตัวเลือกในการแก้ไขฟิลด์หรือเข้าถึงชั้นข้อมูล/ตารางที่เกี่ยวข้อง",
      "description": "คำอธิบาย",
      "descriptionTip": "ตัวเลือกในการป้อนข้อความที่จะแสดงด้านบนของหน้าแอตทริบิวต์",
      "relationTip": "ดูชั้นข้อมูลและตารางที่เกี่ยวข้อง"
    },
    "editFieldError": "การปรับเปลี่ยนฟิลด์และสมาร์ทแอตทริบิวต์ไม่สามารถใช้ได้กับเลชั้นข้อมูลที่ไม่สามารถแก้ไขได้",
    "noConfigedLayersError": "สมาร์ทเอดิเตอร์ต้องใช้งานกับชั้นข้อมูลที่สามารถแก้ไขได้"
  },
  "editDescriptionPage": {
    "title": "กำหนดข้อความบรรยายภาพรวมของแอตทริบิวต์ <b>${layername}</b> "
  },
  "fieldsPage": {
    "title": "กำหนดค่าฟิลด์สำหรับ<b>${layername}</b>",
    "copyActionTip": "การดำเนินการของแอ็ตทริบิวต์",
    "description": "ใช้ปุ่มแก้ไขการดำเนินการเพื่อเปิดใช้งานแอตทริบิวต์อัจฉริยะในชั้นข้อมูล แอตทริบิวต์อัจฉริยะสามารถกำหนด ซ่อนหรือปิดใช้งานฟิลด์ตามค่าในฟิลด์อื่น ๆ ได้ ใช้ปุ่มคัดลอกการดำเนินการเพื่อเปิดใช้งานและกำหนดแหล่งที่มาของค่าในฟิลด์ตามจุดตัดกัน ที่อยู่ พิกัดและที่ตั้งค่าล่วงหน้า",
    "fieldsNotes": "* เป็นฟิลด์บังคับ หากคุณยกเลิกการเลือกแสดงผลสำหรับฟิลด์นี้ และแก้ไขแม่แบบ จะไม่มีการเติมค่าให้กับฟิลด์นี้ ที่คุณจะไม่สามารถบันทึกข้อมูลใหม่ได้",
    "smartAttachmentText": "กำหนดค่าการดำเนินการของไฟล์แนบอัจฉริยะ",
    "smartAttachmentPopupTitle": "กำหนดค่าไฟล์แนบอัจฉริยะสำหรับ <b>${layername}</b>",
    "fieldsSettingsTable": {
      "display": "แสดงผล",
      "displayTip": "ตรวจสอบว่าฟิลด์นี้ที่ไม่สามารถมองเห็นได้",
      "edit": "ที่สามารถแก้ไขได้",
      "editTip": "ตรวจสอบว่าถ้าฟิลด์นี้แสดงในฟอร์มของแอตทริบิวต์",
      "fieldName": "ชื่อ",
      "fieldNameTip": "ชื่อของฟิลด์ที่กำหนดไว้ในฐานข้อมูล",
      "fieldAlias": "ชื่อย่อ",
      "fieldAliasTip": "ชื่อฟิลด์ที่กำหนดไว้ในแผนที่",
      "canPresetValue": "ตั้งล่วงหน้า",
      "canPresetValueTip": "ตัวเลือกที่จะแสดงฟิลด์ในรายการฟิลด์ที่กำหนดไว้ล่วงหน้า และอนุญาตให้ผู้ใช้สามารถกำหนดค่าก่อนที่จะมีการแก้ไข",
      "actions": "การดำเนินการ",
      "actionsTip": "เปลี่ยนลำดับของฟิลด์ หรือตั้งค่าสมาร์ทแอตทริบิวต์"
    },
    "smartAttSupport": "สมาร์ทแอตทริบิวต์ยังไม่ได้รับการสนับสนุนในฟิลด์ของฐานข้อมูลนี้"
  },
  "actionPage": {
    "title": "กำหนดค่าการดำเนินการของแอ็ตทริบิวต์สำหรับ <b>${fieldname}</b>",
    "description": "การดำเนินการนี้ จะปิดจนกว่าคุณจะระบุเงื่อนไขที่ทำให้ทำงาน การดำเนินการทำงานตามลำดับ และจะทำได้เพียงหนึ่งการกระทำต่อแต่ละฟิลด์ ใช้ปุ่มแก้ไขเกณฑ์ ในการกำหนดเกณฑ์",
    "actionsSettingsTable": {
      "rule": "ปฏิบัติ",
      "ruleTip": "การดำเนินการที่ทำเมื่อเป็นไปตามเกณฑ์",
      "expression": "สูตรคำนวณ",
      "expressionTip": "ผลลัพธ์จากสมการในรูปแบบ SQL จากเกณฑ์ที่กำหนดไว้",
      "actions": "เกณฑ์",
      "actionsTip": "เปลี่ยนลำดับของกฎ และกำหนดเกณฑ์เมื่อมันถูกเรียก"
    },
    "copyAction": {
      "description": "แหล่งข้อมูลของฟิลด์จะได้รับการประมวลผลตามลำดับหากเปิดใช้งานจนกว่าจะมีการเรียกใช้เกณฑ์ที่ถูกต้องหรือรายการที่สมบูรณ์ ใช้ปุ่มแก้ไขเกณฑ์เพื่อกำหนดเกณฑ์",
      "intersection": "ทางแยก",
      "coordinates": "ค่าพิกัด",
      "address": "ที่อยู่",
      "preset": "ตั้งล่วงหน้า",
      "actionText": "การดำเนินการ",
      "criteriaText": "เกณฑ์",
      "enableText": "เปิดการใช้งาน"
    },
    "actions": {
      "hide": "ซ่อน",
      "required": "ต้องการ",
      "disabled": "ปิดการใช้งาน"
    }
  },
  "filterPage": {
    "submitHidden": "ส่งข้อมูลแอตทริบิวต์สำหรับข้อมูลนี้ แม้ในขณะที่ฟิลด์ถูกซ่อนอยู่?",
    "title": "กำหนดเงื่อนไขสำหรับ ${action} กฎ",
    "filterBuilder": "กำหนดการกระทำเมื่อค่าในฟิลด์ตรง ${any_or_all} of จากสมการดังต่อไปนี้",
    "noFilterTip": "ใช้เครื่องมือที่ด้านล่างกำหนดคำสั่งสำหรับการดำเนินการเมื่อมีการใช้งาน"
  },
  "geocoderPage": {
    "setGeocoderURL": "ตั้งรหัสเชิงพื้นที่ URL",
    "hintMsg": "หมายเหตุ: คุณกำลังเปลี่ยนบริการตัวระบุรหัสพิกัดทางภูมิศาสตร์ โปรดตรวจสอบการอัปเดตการแม็ปฟิลด์ของตัวระบุรหัสพิกัดทางภูมิศาสตร์ที่คุณกำหนดไว้",
    "invalidUrlTip": "URL ${URL} ไม่ถูกต้อง หรือไม่สามารถเข้าถึงได้"
  },
  "addressPage": {
    "popupTitle": "ที่อยู่",
    "checkboxLabel": "รับค่าจากตัวระบุรหัสพิกัดทางภูมิศาสตร์",
    "selectFieldTitle": "ข้อมูลเชิงบรรยาย:",
    "geocoderHint": "หากต้องการเปลี่ยนแปลงตัวระบุพิกัดทางภูมิศาสตร์ ให้ไปที่ปุ่ม 'การตั้งค่าตัวระบุพิกัดทางภูมิศาสตร์' ในการตั้งค่าทั่วไป"
  },
  "coordinatesPage": {
    "popupTitle": "ค่าพิกัด",
    "checkboxLabel": "รับพิกัด",
    "coordinatesSelectTitle": "ระบบพิกัด:",
    "coordinatesAttributeTitle": "ข้อมูลเชิงบรรยาย:",
    "mapSpatialReference": "การอ้างอิงเชิงพื้นที่ของแผนที่",
    "latlong": "ละติจูด/ลองจิจูด"
  },
  "presetPage": {
    "popupTitle": "ตั้งล่วงหน้า",
    "checkboxLabel": "ฟิลด์จะถูกตั้งค่าล่วงหน้า",
    "presetValueLabel": "ค่าที่กำหนดไว้ล่วงหน้าปัจจุบันคือ:",
    "changePresetValueHint": "หากต้องการเปลี่ยนค่าที่กำหนดไว้ล่วงหน้า ให้ไปที่ปุ่ม 'กำหนดค่าที่กำหนดไว้ล่วงหน้า' ในการตั้งค่าทั่วไป"
  },
  "intersectionPage": {
    "checkboxLabel": "รับค่าจากฟิลด์ของชั้นข้อมูลจุดตัดกัน",
    "layerText": "ชั้นข้อมูล",
    "fieldText": "ฟิลด์",
    "actionsText": "การดำเนินการ",
    "addLayerLinkText": "เพิ่มชั้นข้อมูล"
  },
  "presetAll": {
    "popupTitle": "กำหนดค่าที่กำหนดไว้ล่วงหน้าเริ่มต้น",
    "deleteTitle": "ลบค่าที่กำหนดไว้ล่วงหน้า",
    "hintMsg": "ชื่อช่องฟิลด์ที่กำหนดไว้ล่วงหน้าเฉพาะทั้งหมดจะปรากฏที่นี่ การลบฟิลด์ที่กำหนดไว้ล่วงหน้าออกจะปิดใช้งานฟิลด์ที่เกี่ยวข้องตามที่กำหนดไว้ล่วงหน้าจากชั้นข้อมูล/ตารางทั้งหมด"
  }
});