define({
  "addTaskTip": "Добавить в виджет один или несколько фильтров и настроить их параметры.",
  "enableMapFilter": "Удалить настроенный фильтр слоя с карты.",
  "newFilter": "Новый фильтр",
  "filterExpression": "Выражение фильтра",
  "layerDefaultSymbolTip": "Использовать символы слоя по умолчанию",
  "uploadImage": "Загрузить изображение",
  "selectLayerTip": "Выберите слой.",
  "setTitleTip": "Введите заголовок.",
  "noTasksTip": "Нет настроенных фильтров. Щелкните \"${newFilter}\", чтобы добавить новый.",
  "collapseFiltersTip": "Свернуть выражение фильтра (при наличии), когда виджет открыт",
  "zoomtoTip": "Приблизить к слою при применении фильтра",
  "autoApplyWhenValueInput": "Применить этот фильтр автоматически после ввода значения",
  "autoApplyWhenWidgetOpen": "Применить этот фильтр, когда виджет открыт",
  "info": "Сообщение",
  "expressions": "Выражения",
  "allowCustom": "Разрешить создание пользовательских фильтров"
});