define({
  "addTaskTip": "विजेट पर एक या एक से अधिक फिल्टर जोड़ें और उनमें से प्रत्येक के लिए पैरामीटर कॉन्फ़िगर करें।",
  "enableMapFilter": "मानचित्र से पूर्व निर्धारित लेयर फिल्टर हटाएं।",
  "newFilter": "नया फ़िल्टर",
  "filterExpression": "समीकरण फिल्टर करें",
  "layerDefaultSymbolTip": "लेयर के डिफ़ॉल्ट प्रतीक का उपयोग करें",
  "uploadImage": "एक छवि अपलोड करें",
  "selectLayerTip": "कृपया एक लेयर का चयन करें।",
  "setTitleTip": "शीर्षक निर्धारित करें।",
  "noTasksTip": "कोई फिल्टर कॉन्फ़िगर नहीं किया गया है। नए को जोड़ने के लिए \"${NewFilter}\" पर क्लिक करें।",
  "collapseFiltersTip": "विजेट के खुले होने पर, (यदि कोई) फिल्टर एक्स्प्रेशन हो तो उसे बंद कर दें।",
  "zoomtoTip": "फ़िल्टर लागू होने पर लेयर तक ज़ूम करें",
  "autoApplyWhenValueInput": "मान इनपुट होने के बाद इस फ़िल्टर को स्वचालित रूप से लागू करें",
  "autoApplyWhenWidgetOpen": "विजेट के खुले होने पर यह फ़िल्टर लागू करें",
  "info": "जानकारी",
  "expressions": "एक्सप्रेशन",
  "allowCustom": "कस्टम फ़िल्टर बनाने की अनुमति दें"
});