define({
  "addTaskTip": "เพิ่มตัวกรองอย่างน้อยหนึ่งตัว เพื่อให้วิตเจ็ตใช้กำหนดเป็ฯค่าพารามิเตอร์",
  "enableMapFilter": "ลบการกรองชั้นข้อมูลที่ตั้งไว้ออกจากแผนที่",
  "newFilter": "ตัวกรองใหม่",
  "filterExpression": "สมการของตัวกรอง",
  "layerDefaultSymbolTip": "ใช้สัญลักษณ์ตั้งต้นของชั้นข้อมูล",
  "uploadImage": "อัปโหลดภาพ",
  "selectLayerTip": "กรุณาเลือกชั้นข้อมูล",
  "setTitleTip": "กรุณาตั้งชื่อ",
  "noTasksTip": "ไม่มีการกำหนดค่าฟิลเตอร์ คลิก \"${newFilter}\"เพื่อเพิ่มใหม่",
  "collapseFiltersTip": "ยุบสูตรตัวกรอง (ถ้ามี) เมื่อเปิดวิดเจ็ต",
  "zoomtoTip": "ซูมไปยังชั้นข้อมูลเมื่อใช้ตัวกรอง",
  "autoApplyWhenValueInput": "ใช้ตัวกรองนี้โดยอัตโนมัติหลังจากมีการป้อนค่า",
  "autoApplyWhenWidgetOpen": "ใช้ตัวกรองนี้เมื่อเปิดวิดเจ็ต",
  "info": "ข้อมูล",
  "expressions": "ข้อความสูตร",
  "allowCustom": "อนุญาตให้สร้างตัวกรองที่กำหนดเอง"
});