define({
  "layersPage": {
    "allLayers": "Όλα τα επίπεδα",
    "title": "Επιλέξτε ένα πρότυπο για τη δημιουργία στοιχείων",
    "generalSettings": "Γενικές ρυθμίσεις",
    "layerSettings": "Ρυθμίσεις θεματικού επιπέδου",
    "presetValueText": "Καθορισμός προκαθορισμένων τιμών",
    "geocoderSettingsText": "Ρυθμίσεις εργαλείου γεωκωδικοποίησης",
    "editDescription": "Δώστε το κείμενο εμφάνισης για το πλαίσιο επεξεργασίας",
    "editDescriptionTip": "Αυτό το κείμενο εμφανίζεται επάνω από το Εργαλείο επιλογής προτύπου, αφήστε το κενό για να μην εμφανίζεται κείμενο.",
    "promptOnSave": "Μήνυμα για αποθήκευση των μη αποθηκευμένων αλλαγών όταν είναι κλειστή η φόρμα ή όταν γίνεται μετάβαση στην επόμενη εγγραφή.",
    "promptOnSaveTip": "Εμφανίζει μήνυμα όταν ο χρήσης πατά κλείσιμο ή μεταβαίνει στην επόμενη επεξεργάσιμη εγγραφή εφόσον το τρέχον στοιχείο έχει μη αποθηκευμένες αλλαγές.",
    "promptOnDelete": "Να απαιτείται επιβεβαίωση για τη διαγραφή εγγραφής.",
    "promptOnDeleteTip": "Να παρουσιάζεται προτροπή όταν ο χρήστης κάνει κλικ στην επιλογή διαγραφής για επιβεβαίωση της ενέργειας.",
    "removeOnSave": "Κατάργηση στοιχείου από την επιλογή με την αποθήκευση.",
    "removeOnSaveTip": "Επιλογή για διαγραφή του στοιχείου από το σύνολο της επιλογής κατά την αποθήκευση της εγγραφής. Εάν αυτή είναι η μοναδική επιλεγμένη εγγραφή, το πλαίσιο επιστρέφει στη σελίδα προτύπου.",
    "useFilterEditor": "Χρήση φίλτρου προτύπου στοιχείων",
    "useFilterEditorTip": "Επιλογή για χρήση του Εργαλείου επιλογής προτύπου φίλτρου το οποίο παρέχει τη δυνατότητα προβολής του προτύπου ενός θεματικού επιπέδου ή αναζήτησης για πρότυπα ονομαστικά.",
    "displayShapeSelector": "Εμφάνιση επιλογών σχεδίασης",
    "displayShapeSelectorTip": "Επιλογή εμφάνισης λίστας έγκυρων επιλογών σχεδίασης για το επιλεγμένο πρότυπο.",
    "displayPresetTop": "Εμφάνιση λίστας προκαθορισμένων τιμών στην κορυφή",
    "displayPresetTopTip": "Επιλογή εμφάνισης της λίστας προκαθορισμένων τιμών επάνω από το εργαλείο επιλογής προτύπου.",
    "listenToGroupFilter": "Εφαρμογή τιμών φίλτρου από το widget Φίλτρο ομάδας στα προκαθορισμένα πεδία",
    "listenToGroupFilterTip": "Όταν εφαρμόζεται φίλτρο στο widget φίλτρου ομάδας, εφαρμόστε την τιμή σε ένα αντίστοιχο πεδίο στη λίστα προκαθορισμένων τιμών.",
    "keepTemplateActive": "Διατήρηση ενεργού του επιλεγμένου προτύπου",
    "keepTemplateActiveTip": "Όταν εμφανίζεται ο επιλογέας προτύπων, αν κάποιο πρότυπο είχε επιλεγεί προηγουμένως, επιλέξτε το ξανά.",
    "geometryEditDefault": "Ενεργοποίηση επεξεργασίας γεωμετρίας από προεπιλογή",
    "autoSaveEdits": "Η εργασία επεξεργασίας αποθηκεύεται αυτόματα.",
    "enableAttributeUpdates": "Εμφάνιση κουμπιού ενημέρωσης ενεργειών γνωρισμάτων όταν είναι ενεργή η επεξεργασία γεωμετρίας",
    "layerSettingsTable": {
      "allowDelete": "Να επιτρέπεται η διαγραφή",
      "allowDeleteTip": "Επιλογή που επιτρέπει στο χρήστη να διαγράψει ένα στοιχείο. Απενεργοποιημένη εάν το θεματικό επίπεδο δεν υποστηρίζει διαγραφή.",
      "edit": "Επεξεργάσιμο",
      "editTip": "Επιλογή για να συμπεριληφθεί το θεματικό επίπεδο στο widget",
      "label": "Θεματικό επίπεδο",
      "labelTip": "Το όνομα του θεματικού επιπέδου όπως ορίζεται στο χάρτη",
      "update": "Απενεργοποίηση επεξεργασίας γεωμετρικού τύπου",
      "updateTip": "Επιλογή για την απενεργοποίηση της δυνατότητας μετακίνησης του γεωμετρικού τύπου μετά την τοποθέτησή του ή μετακίνησης του γεωμετρικού τύπου σε υπάρχον στοιχείο",
      "allowUpdateOnly": "Μόνο ενημέρωση",
      "allowUpdateOnlyTip": "Επιλογή που επιτρέπει μόνο την τροποποίηση των υπαρχόντων στοιχείων. Με βάση την προεπιλεγμένη ρύθμιση είναι ενεργοποιημένη. Απενεργοποιείται αν το θεματικό επίπεδο δεν υποστηρίζει τη δημιουργία νέων στοιχείων.",
      "fieldsTip": "Τροποποίηση των πεδίων που θα υποστούν επεξεργασία και ορισμός έξυπνων γνωρισμάτων",
      "actionsTip": "Επιλογή για επεξεργασία πεδίων ή πρόσβαση σε σχετικά θεματικά επίπεδα/σχετικούς πίνακες",
      "description": "Περιγραφή",
      "descriptionTip": "Επιλογή για την εισαγωγή κειμένου που θα εμφανίζεται στην κορυφή της σελίδας γνωρισμάτων.",
      "relationTip": "Προβολή σχετικών θεματικών επιπέδων και πινάκων"
    },
    "editFieldError": "Τροποποιήσεις πεδίων και έξυπνα γνωρίσματα δεν είναι διαθέσιμα σε θεματικά επίπεδα χωρίς δυνατότητα επεξεργασίας",
    "noConfigedLayersError": "Το Εργαλείο έξυπνης επεξεργασίας απαιτεί ένα ή περισσότερα θεματικά επίπεδα με δυνατότητα επεξεργασίας"
  },
  "editDescriptionPage": {
    "title": "Ορίστε το κείμενο επισκόπησης γνωρίσματος για <b>${layername}</b> "
  },
  "fieldsPage": {
    "title": "Διαμορφώστε πεδία για <b>${layername}</b>",
    "copyActionTip": "Ενέργειες γνωρισμάτων",
    "description": "Χρησιμοποιήστε το κουμπί επεξεργασίας ενεργειών προκειμένου να ενεργοποιήσετε τα Έξυπνα γνωρίσματα σε κάποιο θεματικό επίπεδο. Τα Έξυπνα γνωρίσματα μπορούν να απαιτούν, να κρύβουν ή να απενεργοποιούν ένα πεδίο με βάση τις τιμές σε άλλα πεδία. Χρησιμοποιήστε το κουμπί αντιγραφής ενεργειών για να ενεργοποιήσετε και να καθορίσετε την πηγή της τιμής του πεδίου κατά τομή, διεύθυνση, συντεταγμένες και προκαθορισμένες ρυθμίσεις.",
    "fieldsNotes": "* είναι απαιτούμενο πεδίο. Αν δεν επιλέξετε Εμφάνιση για αυτό το πεδίο, και το πρότυπο επεξεργασίας δεν συμπληρώνει την τιμή του πεδίου, δεν θα μπορείτε να αποθηκεύσετε μια νέα εγγραφή.",
    "smartAttachmentText": "Παραμετροποίηση της ενέργειας έξυπνων συνημμένων",
    "smartAttachmentPopupTitle": "Παραμετροποίηση έξυπνων συνημμένων για <b>${layername}</b>",
    "fieldsSettingsTable": {
      "display": "Εμφάνιση",
      "displayTip": "Καθορίζει εάν το πεδίο θα είναι ορατό",
      "edit": "Επεξεργάσιμο",
      "editTip": "Επιλέξτε το εάν το πεδίο είναι ορατό στη φόρμα γνωρισμάτων",
      "fieldName": "Όνομα",
      "fieldNameTip": "Το όνομα του πεδίου όπως ορίζεται στη βάση δεδομένων",
      "fieldAlias": "Ψευδώνυμο",
      "fieldAliasTip": "Το όνομα του πεδίου που είναι ορισμένο στο χάρτη",
      "canPresetValue": "Προκαθορισμένα",
      "canPresetValueTip": "Επιλογή για να εμφανίζεται το πεδίο στη λίστα προκαθορισμένων πεδίων και να μπορεί ο χρήστης να ορίσει την τιμή πριν την επεξεργασία",
      "actions": "Ενέργειες",
      "actionsTip": "Αλλάξτε τη σειρά των πεδίων ή ορίστε έξυπνα γνωρίσματα"
    },
    "smartAttSupport": "Τα έξυπνα γνωρίσματα δεν υποστηρίζονται σε απαιτούμενα πεδία βάσης δεδομένων"
  },
  "actionPage": {
    "title": "Παραμετροποίηση των ενεργειών γνωρισμάτων για <b>${fieldname}</b>",
    "description": "Οι ενέργειες είναι πάντα απενεργοποιημένες εκτός εάν ορίσετε τα κριτήρια βάσει των οποίων θα ενεργοποιούνται. Οι ενέργειες θα εκτελούνται με τη σειρά και μόνο μία ενέργεια θα ενεργοποιείται ανά πεδίο. Χρησιμοποιήστε το κουμπί επεξεργασίας Κριτήρια για να ορίσετε τα κριτήρια.",
    "actionsSettingsTable": {
      "rule": "Ενέργεια",
      "ruleTip": "Ενέργεια που θα εκτελείται όποτε πληρούνται τα κριτήρια",
      "expression": "Έκφραση",
      "expressionTip": "Η έκφραση που προκύπτει σε μορφή SQL από τα ορισμένα κριτήρια",
      "actions": "Κριτήρια",
      "actionsTip": "Αλλάξτε τη σειρά του κανόνα και ορίστε τα κριτήρια για την ενεργοποίηση"
    },
    "copyAction": {
      "description": "Η σειρά των πηγών τιμών πεδίων υποβάλλεται σε επεξεργασία αν ενεργοποιηθεί ως τη στιγμή που θα ενεργοποιηθεί κάποιο έγκυρο κριτήριο ή θα ολοκληρωθεί η λίστα. Χρησιμοποιήστε το κουμπί «Επεξεργασία κριτηρίων» για να καθορίσετε τα κριτήρια.",
      "intersection": "Διασταύρωση",
      "coordinates": "Συντεταγμένες",
      "address": "Διεύθυνση",
      "preset": "Προκαθορισμένα",
      "actionText": "Ενέργειες",
      "criteriaText": "Κριτήρια",
      "enableText": "Ενεργοποιήθηκαν."
    },
    "actions": {
      "hide": "Απόκρυψη",
      "required": "Απαιτείται",
      "disabled": "Απενεργοποιήθηκε"
    }
  },
  "filterPage": {
    "submitHidden": "Να υποβάλλονται δεδομένα γνωρίσματος για το πεδίο ακόμη και όταν δεν εμφανίζεται;",
    "title": "Διαμόρφωση παράστασης για τον κανόνα ${action}",
    "filterBuilder": "Ορίστε ενέργεια για το πεδίο όταν η εγγραφή συμφωνεί με ${any_or_all} τις παρακάτω εκφράσεις",
    "noFilterTip": "Χρησιμοποιώντας τα εργαλεία παρακάτω, ορίστε την πρόταση που θα ισχύει όταν η ενέργεια είναι ενεργή."
  },
  "geocoderPage": {
    "setGeocoderURL": "Ορισμός URL Εργαλείου γεωκωδικοποίησης",
    "hintMsg": "Σημείωση: Αυτή τη στιγμή αλλάζετε την υπηρεσία του Εργαλείου γεωκωδικοποίησης. Φροντίστε να ενημερώσετε κάθε αντιστοίχιση πεδίων του Εργαλείου γεωκωδικοποίησης την οποία έχετε παραμετροποιήσει.",
    "invalidUrlTip": "Η URL διεύθυνση ${URL} είναι μη έγκυρη ή χωρίς δυνατότητα πρόσβασης."
  },
  "addressPage": {
    "popupTitle": "Διεύθυνση",
    "checkboxLabel": "Λήψη τιμής από το Eργαλείο γεωκωδικοποίησης",
    "selectFieldTitle": "Γνώρισμα:",
    "geocoderHint": "Για να αλλάξετε Eργαλείο γεωκωδικοποίησης, πηγαίνετε στο κουμπί «Ρυθμίσεις Eργαλείου γεωκωδικοποίησης» στις γενικές ρυθμίσεις."
  },
  "coordinatesPage": {
    "popupTitle": "Συντεταγμένες",
    "checkboxLabel": "Λήψη συντεταγμένων",
    "coordinatesSelectTitle": "Σύστημα συντεταγμένων:",
    "coordinatesAttributeTitle": "Γνώρισμα:",
    "mapSpatialReference": "Χωρική αναφορά χάρτη",
    "latlong": "Γεωγραφικό πλάτος/Γεωγραφικό μήκος"
  },
  "presetPage": {
    "popupTitle": "Προκαθορισμένα",
    "checkboxLabel": "Το πεδίο θα είναι προκαθορισμένο.",
    "presetValueLabel": "Η τρέχουσα προκαθορισμένη τιμή είναι:",
    "changePresetValueHint": "Για να αλλάξετε αυτή την προεπιλεγμένη τιμή, πηγαίνετε στο κουμπί «Καθορισμός προκαθορισμένων τιμών» στις γενικές ρυθμίσεις."
  },
  "intersectionPage": {
    "checkboxLabel": "Λήψη τιμής από πεδίο θεματικού επιπέδου τομής",
    "layerText": "Θεματικά επίπεδα",
    "fieldText": "Πεδία",
    "actionsText": "Ενέργειες",
    "addLayerLinkText": "Προσθήκη θεματικού επιπέδου"
  },
  "presetAll": {
    "popupTitle": "Καθορισμός των προεπιλεγμένων προκαθορισμένων τιμών",
    "deleteTitle": "Διαγραφή προκαθορισμένης τιμής",
    "hintMsg": "Όλα τα μοναδικά ονόματα προκαθορισμένων πεδίων παρατίθενται σε λίστα εδώ. Αν καταργήσετε ένα προκαθορισμένο πεδίο, το αντίστοιχο πεδίο θα απενεργοποιηθεί από το σύνολο των θεματικών επιπέδων/πινάκων και θα πάψει να εμφανίζεται ως προκαθορισμένο."
  }
});