define({
  "allowSaveAs": "อนุญาตการส่งออก",
  "startingState": "สถานะเริ่มต้น:",
  "byUrl": "แบบจำลองเปล่า",
  "byItem": "รูปแบบที่กำหนดค่าไว้ล่วงหน้า",
  "imageServiceUrl": "URL บริการภาพ",
  "validate": "การตรวจสอบ",
  "validating": "กำลังตรวจสอบ...",
  "validated": "URL ถูกต้อง",
  "modelName": "แบบ",
  "selectModel": "เลือก",
  "itemSelectorTitle": "เลือกรุ่น",
  "ok": "ตกลง",
  "cancel": "ยกเลิก",
  "description1": "เครื่องสร้างโมเดลความเหมาะสมจะช่วยให้คุณหาตำแหน่งที่ดีที่สุดสำหรับกิจกรรมคาดการณ์ความไวต่อความเสี่ยงหรือระบุว่ามีอะไรที่จะเกิดขึ้น วิดเจ็ตนี้ช่วยให้คุณสามารถรวมและน้ำหนักของชั้นต่างๆเพื่อให้คุณสามารถประเมินหลาย ๆ ปัจจัยพร้อมกัน",
  "description2": "เครื่องจำลองความเหมาะกับผู้ใช้ใช้การซ้อนทับแบบถ่วงน้ำหนักแบบเว็บที่รวดเร็วเพื่อสร้างแบบจำลองจากบริการ คุณสามารถเริ่มต้นจากสถานะว่างของบริการการวางซ้อนน้ำหนัก (Raster Overlay) ของน้ำหนัก (WRO) หรือรูปแบบ WRO ที่กำหนดไว้ล่วงหน้า เลือกเลเยอร์กำหนดน้ำหนักและปรับค่าการจำแนกชั้นเพื่อกำหนดการวิเคราะห์ของคุณ จากนั้นให้เรียกใช้แบบจำลองผลการค้นหาผลลัพธ์และเลือกบันทึกผลลัพธ์เป็นรายการในองค์กร / พอร์ทัลของคุณ",
  "description3": "เรียนรู้เพิ่มเติมเกี่ยวกับแบบจำลองความเหมาะสม GeoPlanner"
});