define({
  "default": {
    "name": "ค่าตั้งต้น",
    "description": "ค่าตั้งต้น"
  },
  "editor": {
    "name": "เครื่องมือแก้ไข",
    "description": "แก้ไข และสร้างชิ้นข้อมูลบนชั้นข้อมูลในเวปไซต์ "
  },
  "basic_viewer": {
    "name": "กราวด์ซีโร่",
    "description": "รวมถึงการเปิดใช้งานปุ่มอื่นๆทั่วไป เพื่อแสดงผล และโต้ตอบกับแผนที่"
  },
  "simple_map_viewer": {
    "name": "แมพเล็ต",
    "description": "เตรียมตัวอย่างผู้ใช้งานเพื่อสำรวจเวปแผนที่"
  },
  "infographic_dashboard": {
    "name": "แดชบอร์ดอินโฟกราฟิก (แอปตัวอย่าง) ",
    "description": "ตัวอย่างแอปแดชบอร์ดที่แสดงถึงความสามารถต่างๆ ของธีมแดชบอร์ดและวิดเจ็ตอินโฟกราฟิก"
  }
});