define({
  "configText": "नीचे अपने फ़िल्टर समूहों को निर्धारित करें",
  "labels": {
    "groupName": "निर्धारित नाम फिल्टर करें:",
    "groupNameTip": "उस फिल्टर का नाम जिसमें से उपयोगकर्ता चयन करेगा।",
    "groupDesc": "विवरण:",
    "groupDescTip": "फिल्टर सेट का विवरण।",
    "groupOperator": "पूर्व निर्धारित ऑपरेटर:",
    "groupOperatorTip": "फिल्टर के ऑपरेटर का पूर्व वर्णन करने के लिए विकल्प। यदि किसी भी पूर्व निर्धारित ऑपरेटर का चयन नहीं किया गया है, फिल्टर समान ऑपरेटर का प्रयोग करेंगे।",
    "groupDefault": "पूर्व निर्धारित मान:",
    "groupDefaultTip": "मौजूदा लेयर से मान चुनने का विकल्प।",
    "sameLayerAppend": "किसी लेयर के एक से अधिक बार सूचीबद्ध होने पर:",
    "sameLayerConjunc": "इसके इस्तेमाल से सलंग्न करें:",
    "caseSearch": "अक्षरों के प्रति संवेदनशील खोज निष्पादित करें: "
  },
  "buttons": {
    "addNewGroup": "एक नया समूह जोड़ें",
    "addNewGroupTip": "एक नया फिल्टर सेट जोड़ें।",
    "addLayer": "लेयर जोड़ें",
    "addLayerTip": "फिल्टर सेट करने के लिए एक लेयर जोड़ें।"
  },
  "inputs": {
    "groupName": "अपने समूह को नाम दें",
    "groupDesc": "आपके समूह के लिए विवरण",
    "groupDefault": "एक पूर्वनिर्धारित मान दर्ज करें",
    "sameLayerAny": "किसी भी व्यंजक का मिलान करें",
    "sameLayerAll": "सभी व्यंजक का मिलान करें",
    "simpleMode": "साधारण दृश्य में शुरू करें",
    "simpleModeTip": "कॉन्फ़िगर किए गए विजेट इंटरफ़ेस को सरल करने के लिए विकल्प। जब चयनित होता है, तो ऑपरेटर ड्रॉप-डाउन सूची और मानदंड जोड़ें बटन को इंटरफ़ेस से हटा दिया जाता है।",
    "webmapAppendModeAny": "मौजूदा मैप फ़िल्टर से कोई व्यंजक जोड़ें",
    "webmapAppendModeAll": "मौजूदा मैप फ़िल्टर से सभी व्यंजक जोड़ें",
    "webmapAppendModeTip": "मौजूदा वेब मैप फ़िल्टर में फ़िल्टर सेट जोड़ने के लिए विकल्प।",
    "persistOnClose": "विजेट बंद होने के बाद जारी रहता है",
    "optionsMode": "विजेट विकल्प छुपाएं",
    "optionsModeTip": "अतिरिक्त विजेट सेटिंग्स दिखाने के लिए विकल्प। यदि चयनित है,तो सहेजने और लोड करने संबंधी निर्धारित फिल्टर और विजेट के बंद होने के बाद फिल्टर बने रहने को इंटरफेस से हटा दिया जाता है।",
    "optionOR": "या",
    "optionAND": "तथा",
    "optionEQUAL": "बराबर",
    "optionNOTEQUAL": "बराबर नहीं",
    "optionGREATERTHAN": "इस से अधिक",
    "optionGREATERTHANEQUAL": "इस से बड़ा या बराबर",
    "optionLESSTHAN": "इस से कम",
    "optionLESSTHANEQUAL": "इससे कम या इसके बराबर",
    "optionSTART": "इसके साथ शुरू होता है",
    "optionEND": "इसी के साथ समाप्त होता है",
    "optionLIKE": "शामिल है",
    "optionNOTLIKE": "शामिल नहीं है",
    "optionONORBEFORE": "को या उससे पहले है",
    "optionONORAFTER": "को या उसके बाद है",
    "optionNONE": "कोई नहीं"
  },
  "tables": {
    "layer": "लेयर",
    "layerTip": "मानचित्र में परिभाषित अनुसार लेयर का नाम।",
    "field": "फ़ील्ड",
    "fieldTip": "फील्ड जिस पर लेयर को फिल्टर किया जायेगा।",
    "value": "मान का इस्तेमाल करें",
    "valueTip": "लेयर से ड्रॉप-डाउन सूची मानों को इस्तेमाल करने का विकल्प। यदि कोई लेयर इस पैरामीटर का इस्तेमाल नहीं करती है, उपयोगकर्ता के लिए एक प्लेन टैक्स्ट बॉक्स प्रस्तुत किया जाएगा।",
    "zoom": "ज़ूम करें",
    "zoomTip": "फिल्टर लागू करने के बाद फीचर की सीमा तक ज़ूम करने का विकल्प। ज़ूम करने के लिए केवल एक लेयर को चुना जा सकता है।",
    "action": "हटाएँ",
    "actionTip": "फिल्टर सेट से लेयर निकालें।"
  },
  "popup": {
    "label": "एक मान चुनें"
  },
  "errors": {
    "noGroups": "आप को कम से कम एक समूह की जरूरत है।",
    "noGroupName": "एक या एक से अधिक समूह के नाम उपलब्ध नहीं हैं।",
    "noDuplicates": "एक या एक से अधिक समूह नाम दोहराए गए हैं।",
    "noRows": "आप को तालिका में कम से कम एक पंक्ति की जरूरत है।",
    "noLayers": "आप के पास अपने नक्शे में कोई लेयर नहीं है।"
  },
  "picker": {
    "description": "इस समूह के लिए एक पूर्व निर्धारित मान को खोजने के लिए इस फार्म का प्रयोग करें।",
    "layer": "एक लेयर का चयन करें",
    "layerTip": "वेब मानचित्र में परिभाषित अनुसार लेयर का नाम।",
    "field": "एक फ़ील्ड का चयन करें",
    "fieldTip": "वह फ़ील्ड जिसमें से पूर्व निर्धारित मान निर्धारित किया जाएगा।",
    "value": "एक मान का चयन करें",
    "valueTip": "वह मान जो विजेट का डिफ़ॉल्ट होगा।"
  }
});