define({
  "allowSaveAs": "निर्यात की अनुमति दें",
  "startingState": "शुरू करने की स्थिति:",
  "byUrl": "रिक्त मॉडल",
  "byItem": "पहले से कॉन्फ़िगर मॉडल",
  "imageServiceUrl": "छवि सेवा URL",
  "validate": "मान्य करें",
  "validating": "मान्य किया जा रहा है...",
  "validated": "URL मान्य है।",
  "modelName": "मॉडल",
  "selectModel": "चुनें",
  "itemSelectorTitle": "मॉडल चुनें",
  "ok": "ठीक है",
  "cancel": "रद्द करें",
  "description1": "सूटेबिलिटी मॉडलर की मदद से आप गतिविधि के लिए सबसे बेहतरीन जगह ढूंढ सकते हैं, जोखिम की संभावनाओं का अनुमान लगा सकते हैं या जहाँ कुछ घटित होने वाला उस जगह की पहचान करना। इस विजेट की मदद से आप अलग-अलग लेयरों को मिलकर उनका वजन जांच सकते हैं ताकि आप कई सारे कारकों का एक बार में ही मूल्यांकन कर सकें।",
  "description2": "सूटेबिलिटी मॉडलर, सेवा से मॉडल जनरेट करने के लिए वेब आधारित तेज़ भारित रैस्टर ओवरले का इस्तेमाल करता है। आप भारित रैस्टर ओवरले (WRO) सेवा या पहले से कॉन्फ़िगर WRO मॉडल की रिक्त स्थिति से शुरुआत कर सकते हैं। अपने विश्लेषण को निर्धारित करने के लिए लेयर चुनें, भार निर्धारित करें, लेयर वर्गीकरण के मान को ज़रूरत के अनुसार ढालें। इसके बाद मॉडलर चलाएँ, परिणामों की रूपरेखा बनाएँ और वैकल्पिक रूप से परिणाम को आइटम के रूप में अपने संगठन/पोर्टल पर सहेजें।",
  "description3": "GeoPlanner सूटेबिलिटी मॉडलर के बारे में अधिक जानें।"
});