define({
  "addTaskTip": "أضف عامل تصفية أو أكثر لعنصر واجهة المستخدم، وقم بتكوين معلمات كل منها.",
  "enableMapFilter": "إزالة عامل تصفية الطبقة المُعد مُسبقًا من الخريطة.",
  "newFilter": "عامل تصفية جديد",
  "filterExpression": "تعبير عامل التنقية",
  "layerDefaultSymbolTip": "استخدم رمز افتراضي للطبقة",
  "uploadImage": "قم بتحميل صورة",
  "selectLayerTip": "يرجى تحديد طبقة.",
  "setTitleTip": "يرجى تعيين عنوان.",
  "noTasksTip": "لم يتم تكوين أي عمليات تصفية. انقر فوق \"${newFilter}\" لإضافة استعلام جديد.",
  "collapseFiltersTip": "طي تعبيرات عامل التصفية (إن وجدت) عند فتح عنصر واجهة المستخدم",
  "zoomtoTip": "تكبير/تصغير الطبقة عند تطبيق عامل التصفية",
  "autoApplyWhenValueInput": "تطبيق عامل التصفية تلقائيًا بعد أن يكون المدخل هو قيمة",
  "autoApplyWhenWidgetOpen": "تطبيق عامل التصفية عند فتح عنصر واجهة المستخدم",
  "info": "معلومات",
  "expressions": "التعبيرات",
  "allowCustom": "السماح بإنشاء عوامل تصفية مخصصة"
});