define({
  "settingsHeader": "กำหนดรายละเอียดสำหรับวิจเก็ต GeoLookup",
  "settingsDesc": "จีโอเอ็นริช แสดงรายการสถานที่จากไฟล์ CSV เทียบกับชั้นข้อมูลพื้นที่รูปปิดบนแผนที่ โดยฟิลด์ที่เลือกในชั้นข้อมูลพื้นที่จะใช้เชื่อมต่อกับตำแหน่ง",
  "settingsLoadingLayers": "โปรดรอสักครู่ในขณะที่ชั้นกำลังโหลด",
  "settingsConfigureTitle": "ปรับแต่งฟิลด์ชั้นข้อมูล",
  "layerTable": {
    "colEnrich": "เพิ่ม",
    "colLabel": "ชั้นข้อมูล",
    "colFieldSelector": "ฟิลด์"
  },
  "fieldTable": {
    "colAppend": "ผนวก",
    "colName": "ชื่อ",
    "colAlias": "ชื่อย่อ",
    "colOrder": "การดำเนินการ",
    "label": "ตรวจสอบฟิลด์ที่คุณต้องการจะผนวก เลือกฟิลด์เพื่ออัพเดทบนชื่อสำรองและคำสั่ง"
  },
  "symbolArea": {
    "symbolLabelWithin": "เลือกสัญลักษณ์ของตำแหน่งที่อยู่ภายในระยะ :",
    "symbolLabelOutside": "เลือกสัญลักษณ์ของตำแหน่งที่อยู่ภายนอก  :"
  },
  "advSettings": {
    "label": "การตั้งค่าระดับสูง",
    "latFieldsDesc": "ชื่อฟิลด์ที่เป็นไปได้สำหรับข้อมูลละติจูด",
    "longFieldsDesc": "ชื่อฟิลด์ที่เป็นไปได้สำหรับข้อมูลลองติจูด",
    "intersectFieldDesc": "ชื่อฟิลด์ที่สร้างขึ้นเพื่อจัดเก็บค่าที่ค้นหาข้อมูลที่ intersected",
    "intersectInDesc": "การจัดเก็บค่าโพลิกอนที่ intersec",
    "intersectOutDesc": "ค่าที่จะเก็บตำแหน่งไม่ซ้อนทับกับพื้นที่",
    "maxRowCount": "จำนวนสูงสุดของแถวในไฟล์ CSV",
    "cacheNumberDesc": "กลุ่มคลัสเตอร์ของจุดในช่วงที่กำหนดจะทำให้ประมวลผลได้เร็วขึ้น",
    "subTitle": "ตั้งค่าสำหรับไฟล์ CSV",
    "geometryServiceDesc": "URL บริการเรขาคณิตสำหรับการแปลงพิกัดจุดใหม่"
  },
  "noPolygonLayers": "ไม่มีชั้นข้อมูลโพลิกอน",
  "errorOnOk": "กรุณากรอกพารามิเตอร์ทั้งหมดก่อนที่จะบันทึกการตั้งค่า",
  "saveFields": "บันทึกฟิลด์",
  "cancelFields": "ยกเลิกฟิลด์",
  "saveAdv": "บันทึกการตั้งค่าขั้นสูง",
  "cancelAdv": "ยกเลิกการตั้งค่าขั้นสูง",
  "advSettingsBtn": "การตั้งค่าระดับสูง",
  "chooseSymbol": "เลือกสัญลักษณ์",
  "okBtn": "ตกลง",
  "cancelBtn": "ยกเลิก"
});