define({
  "allowSaveAs": "Разрешить экспорт",
  "startingState": "Начальное состояние:",
  "byUrl": "Пустая модель",
  "byItem": "Предварительно настроенная модель",
  "imageServiceUrl": "URL Сервиса изображений",
  "validate": "Проверить",
  "validating": "Проверка...",
  "validated": "Этот URL корректный.",
  "modelName": "Модель",
  "selectModel": "Выбрать",
  "itemSelectorTitle": "Выбрать модель",
  "ok": "OK",
  "cancel": "Отмена",
  "description1": "Модель пригодности поможет вам найти наилучшее местоположение для какого-либо действия, спрогнозировать риски или идентифицировать местоположения возможных событий. Это виджет позволяет комбинировать и взвешивать разные слои, что позволит вам оценить множество факторов влияния.",
  "description2": "Модель пригодности использует удобный веб-инструмент Взвешенное наложение растров, строящий модель из сервиса. Вы можете начать с пустого сервиса Weight Raster Overlay (WRO) или с какой-либо предварительно настроенной модели WRO. Выберите слои, назначьте веса и классифицируйте значения слоев для анализа. Далее запустите разработчик, визуализируйте результаты и, если необходимо, сохраните результат в своей организации/на портале.",
  "description3": "Более подробно о разработчике пригодности GeoPlanner."
});