define({
  "styleText": "Επιλέξτε ένα στυλ για το εργαλείο swipe",
  "vertical": "Κατακόρυφη γραμμή",
  "horizontal": "Οριζόντια γραμμή",
  "scope": "Spyglass",
  "barColor": "Χρώμα γραμμής",
  "layerText": "Επιλέξτε το θεματικό επίπεδο που θέλετε να σαρώνετε από προεπιλογή",
  "spyglassText": "Επιλέξτε το θεματικό επίπεδο που θα εμφανίζεται μέσα στο spyglass εξ' ορισμού.",
  "layerHint": "Σημείωση: Εάν το θεματικό επίπεδο καλύπτεται από ανώτερατα επάνω θεματικά επίπεδα, η σάρωση δεν θα έχει κανένα αποτέλεσμα.",
  "isZoom": "Ζουμ στο θεματικό επίπεδο σάρωσης",
  "layersAvailable": "Επιλογή σε ποια θεματικά επίπεδα θα γίνει σάρωση:"
});