define({
  "addTaskTip": "Προσθέστε ένα ή περισσότερα φίλτρα στο widget και διαμορφώστε τις παραμέτρους για καθένα από αυτά.",
  "enableMapFilter": "Καταργήστε το προκαθορισμένο φίλτρο θεματικού επιπέδου από το χάρτη.",
  "newFilter": "Νέο φίλτρο",
  "filterExpression": "Έκφραση φίλτρου",
  "layerDefaultSymbolTip": "Χρήση του προκαθορισμένου συμβόλου του θεματικού επιπέδου",
  "uploadImage": "Μεταφορτώστε μια εικόνα",
  "selectLayerTip": "Επιλέξτε ένα θεματικό πεδίο.",
  "setTitleTip": "Επιλέξτε τίτλο.",
  "noTasksTip": "Δεν διαμορφώθηκαν φίλτρα. Κάντε κλικ στην επιλογή \"${newFilter}\" για να προσθέσετε νέο.",
  "collapseFiltersTip": "Σύμπτυξη των εκφράσεων των φίλτρων (αν υπάρχουν) κατά το άνοιγμα του widget",
  "zoomtoTip": "Εστίαση στο θεματικό επίπεδο όταν εφαρμοστεί το φίλτρο",
  "autoApplyWhenValueInput": "Εφαρμόστε αυτό το φίλτρο αυτόματα αφότου εισαχθεί μια τιμή",
  "autoApplyWhenWidgetOpen": "Εφαρμόστε αυτό το φίλτρο κατά το άνοιγμα του widget",
  "info": "Πληροφορίες",
  "expressions": "Εκφράσεις",
  "allowCustom": "Να επιτρέπεται δημιουργία προσαρμοσμένων φίλτρων"
});