define({
  "settingsHeader": "GeoLookup विजेट के लिए विवरण निर्धारित करें",
  "settingsDesc": "Geo-enrich मानचित्र पर बहुभुज लेयरस के लिए एक CSV फ़ाइल से स्थानों की एक सूची है। बहुभुज लेयरस से चयनित फ़ील्ड स्थानों से जुड़े होते हैं।",
  "settingsLoadingLayers": "कृपया लेयरस के लोड होने तक प्रतीक्षा करें।",
  "settingsConfigureTitle": "लेयर फील्ड्स को कॉन्फ़िगर करें",
  "layerTable": {
    "colEnrich": "मूल्य वर्द्धन करें",
    "colLabel": "लेयर",
    "colFieldSelector": "फ़ील्ड्स"
  },
  "fieldTable": {
    "colAppend": "जोड़ना",
    "colName": "नाम",
    "colAlias": "उपनाम",
    "colOrder": "कार्रवाइयाँ",
    "label": "जिन फील्ड्स को आप जोड़ना चाहते हैं उनकी जाँच करें। इसके उर्फ ​​और क्रम को अपडेट करने के लिए एक फील्ड का चयन करें।"
  },
  "symbolArea": {
    "symbolLabelWithin": "इसके भीतर स्थानों के लिए चिन्ह का चयन करें:",
    "symbolLabelOutside": "बाहर के स्थानों के लिए चिन्ह का चयन करें:"
  },
  "advSettings": {
    "label": "उन्नत सेटिंग्स",
    "latFieldsDesc": "अक्षांश फील्ड के लिए संभावित फील्ड के नाम।",
    "longFieldsDesc": "देशांतर फील्ड के लिए संभावित फील्ड के नाम।",
    "intersectFieldDesc": "यदि लुकअप एक लेयर को इंटरसेक्ट करता है तो मान को स्टोर करने के लिए बनाई गई फील्ड का नाम।",
    "intersectInDesc": "जब स्थान एक बहुभुज को इंटरसेक्ट करता है तो स्टोर किया जाने वाला मान।",
    "intersectOutDesc": "जब स्थान एक बहुभुज को इंटरसेक्ट नहीं करता है तो स्टोर किया जाने वाला मान।",
    "maxRowCount": "CSV फ़ाइल में पंक्तियों की अधिकतम संख्या।",
    "cacheNumberDesc": "तेज प्रोसेसिंग के लिए बिंदु समूह का थ्रेशोल्ड।",
    "subTitle": "CSV फ़ाइल के लिए मान निर्धारित करें।",
    "geometryServiceDesc": "रिप्रोजेक्टिंग पॉइंट के लिए ज्यामिति सेवा URL।"
  },
  "noPolygonLayers": "कोई बहुभुज लेयरस नहीं हैं",
  "errorOnOk": "कॉन्फिग को सहेजने से पहले सभी पैरामीटरस भरें",
  "saveFields": "फील्ड्स को सहेजें",
  "cancelFields": "फील्ड्स को रद्द करें",
  "saveAdv": "उन्नत सेटिंग्स को सहेजें।",
  "cancelAdv": "उन्नत सेटिंग्स को रद्द करें।",
  "advSettingsBtn": "उन्नत सेटिंग्स",
  "chooseSymbol": "एक चिन्ह का चयन करें",
  "okBtn": "ठीक है",
  "cancelBtn": "रद्द करें"
});