define({
  "default": {
    "name": "الافتراضي",
    "description": "الافتراضي"
  },
  "editor": {
    "name": "المحرر",
    "description": "حرّر وأنشئ المعالم في طبقات قابلة للتحرير في خريطة الويب. "
  },
  "basic_viewer": {
    "name": "منطقة الصفر",
    "description": "تشمل عناصر واجهة مستخدم عامة عديدة تُمكنك من عرض الخريطة والتفاعل معها."
  },
  "simple_map_viewer": {
    "name": "Maplet",
    "description": "توفير تجربة مستخدم بسيطة لاستكشاف خريطة الويب."
  },
  "infographic_dashboard": {
    "name": "لوحة معلومات إنفوجرافيك (نموذج تطبيق) ",
    "description": "مثال على تطبيق للوحة المعلومات لتوضيح إمكانات نُسُق لوحة المعلومات وعنصر واجهة مستخدم الإنفوجرافيك."
  }
});