define({
  "allowSaveAs": "אפשר יצוא",
  "startingState": "מצב התחלתי:",
  "byUrl": "מודל ריק",
  "byItem": "מודל מוגדר מראש",
  "imageServiceUrl": "URL של שירות תמונה",
  "validate": "אמת",
  "validating": "מאמת...",
  "validated": "ה-URL חוקי.",
  "modelName": "מודל",
  "selectModel": "בחר",
  "itemSelectorTitle": "בחר מודל",
  "ok": "אישור",
  "cancel": "בטל",
  "description1": "'מעצב מידת ההתאמה' עוזר לך למצוא את המיקום הטוב ביותר עבור פעילות, לחזות פגיעות לסיכונים או לזהות היכן צפוי שמשהו יתרחש. ווידג'ט זה מאפשר לך לשלב ולשקלל שכבות שונות כך שתוכל להעריך מספר גורמים בבת אחת.",
  "description2": "'מעצב מידת ההתאמה' משתמש ב'כיסוי רסטר משוקלל' כדי ליצור מודלים משירות. תוכל להתחיל ממצב ריק של שירות 'כיסוי רסטר משוקלל' (WRO) או מודל WRO מוגדר מראש. בחר שכבות, הקצה שקלולים והתאם ערכי סיווג שכבות כדי להגדיר את הניתוח שלך. לאחר מכן, הפעל את המעצב, המחש תוצאות ולבחירתך, שמור את התוצאה כפריט בארגון/פורטל שלך.",
  "description3": "קבל מידע נוסף אודות 'מעצב מידת ההתאמה' של GeoPlanner."
});