define({
  "layersPage": {
    "allLayers": "Все слои",
    "title": "Выберите шаблон для создания объектов",
    "generalSettings": "Общие параметры",
    "layerSettings": "Настройки слоя",
    "presetValueText": "Задать предустановленные значения",
    "geocoderSettingsText": "Настройки геокодера",
    "editDescription": "Введите текст, отображаемый на панели редактирования",
    "editDescriptionTip": "Этот текст будет отображаться над инструментом выбора шаблона, оставьте пустым, если текст не требуется.",
    "promptOnSave": "Запрос на сохранение изменений при закрытии формы или переключении к следующей записи.",
    "promptOnSaveTip": "Отображать запрос, когда пользователь закрывает окно или переходит к следующей редактируемой записи, если у текущего объекта имеются несохраненные изменения.",
    "promptOnDelete": "При удалении записи требуется подтверждение.",
    "promptOnDeleteTip": "Отображать запрос для подтверждения действия, когда пользователь выбирает удаление.",
    "removeOnSave": "Удалить объект из выборки при сохранении.",
    "removeOnSaveTip": "Опция для удаления объекта из выборки при сохранении записи. Если это единственная выбранная запись, панель переключается назад, на страницу шаблона.",
    "useFilterEditor": "Использовать фильтр шаблонов объектов",
    "useFilterEditorTip": "Опция для использования инструмента фильтрации шаблонов, позволяющего просматривать шаблоны слоев или находить их по имени.",
    "displayShapeSelector": "Показать опции рисования",
    "displayShapeSelectorTip": "Опция, показывающая список допустимых опций рисования для выбранного шаблона.",
    "displayPresetTop": "Показать вверху список предустановленных значений",
    "displayPresetTopTip": "Опция, показывающая список предустановленных значений над выбором шаблона.",
    "listenToGroupFilter": "Применить значения фильтра из виджета Фильтр группы к Предустановленным полям",
    "listenToGroupFilterTip": "Когда в виджете Групповой фильтр применяется фильтр, можно применить значение к соответствующему полю в списке Предустановленные значения.",
    "keepTemplateActive": "Поддерживать активность выбранного шаблона",
    "keepTemplateActiveTip": "При отображении инструмента выбора шаблона, если шаблон уже был выделен, происходит его повторное выделение.",
    "geometryEditDefault": "Включить редактирование геометрии по умолчанию",
    "autoSaveEdits": "Сохраняет изменения автоматически",
    "enableAttributeUpdates": "Показать кнопку обновления действий атрибута, когда активно редактирование геометрии",
    "layerSettingsTable": {
      "allowDelete": "Разрешить удаление",
      "allowDeleteTip": "Опция, разрешающая пользователю удалять объект; отключена, если слой не поддерживает удаление",
      "edit": "Редактируемый",
      "editTip": "Опции для включения слоя в виджет",
      "label": "Слой",
      "labelTip": "Имя слоя, как определено на карте",
      "update": "Отключить Редактирование геометрии",
      "updateTip": "Опция для отключения возможности перемещения геометрии после ее размещения или перемещения геометрии на существующий объект",
      "allowUpdateOnly": "Только обновление",
      "allowUpdateOnlyTip": "Опция, разрешающая только изменение имеющихся объектов, включена по умолчанию и отключена, если слой не поддерживает создание новых объектов",
      "fieldsTip": "Изменение редактируемых полей и задание Умных атрибутов",
      "actionsTip": "Опция для редактирования полей или доступа к связанным слоям/таблицам",
      "description": "Описание",
      "descriptionTip": "Опция ввода текста, который отображается вверху страницы атрибутов.",
      "relationTip": "Просмотреть связанные слои и таблицы"
    },
    "editFieldError": "Изменения полей и использование Умных атрибутов не доступно для слоев, не являющихся редактируемыми",
    "noConfigedLayersError": "Для Умного редактора требуется один или несколько редактируемых слоев"
  },
  "editDescriptionPage": {
    "title": "Задать текст обзора атрибутов для <b>${layername}</b> "
  },
  "fieldsPage": {
    "title": "Настроить поля для <b>${layername}</b>",
    "copyActionTip": "Действия атрибута",
    "description": "Использовать кнопку редактирования Действий, чтобы активировать Умные атрибуты в слое. Умные атрибуты могут требовать, скрывать или отключать поля на основании значений в других полях. Используйте кнопку копирования Действий для активирования и задания источников значений поля пересечению, адресу, координатам и предустановкам.",
    "fieldsNotes": "* является обязательным полем. Если вы снимите отметку Отображать у этого поля, а шаблон редактирования не содержит значения для него, вы не сможете сохранить новую запись.",
    "smartAttachmentText": "Настроить действие умных вложений",
    "smartAttachmentPopupTitle": "Настроить умные вложения для <b>${layername}</b>",
    "fieldsSettingsTable": {
      "display": "Отображение",
      "displayTip": "Определяет, является ли поле не отображаемым",
      "edit": "Редактируемый",
      "editTip": "Отметьте, если поле присутствует в атрибутивной форме",
      "fieldName": "Имя",
      "fieldNameTip": "Имя поля, определенное базой данных",
      "fieldAlias": "Псевдоним",
      "fieldAliasTip": "Имя поля, определенное картой",
      "canPresetValue": "Предустановленное",
      "canPresetValueTip": "Опция отображения поля в списке заранее заданных полей, позволяющая пользователю задать значение до редактирования",
      "actions": "Действия",
      "actionsTip": "Изменить порядок полей или настроить Умные атрибуты"
    },
    "smartAttSupport": "Умные атрибуты не поддерживаются для обязательных полей базы данных"
  },
  "actionPage": {
    "title": "Настроить действия атрибутов для<b>${fieldname}</b>",
    "description": "Действия всегда отключены, пока вы не зададите критерии, включающие их. Действия выполняются в заданном порядке и только одно действие может быть запущено для поля. Используйте кнопку Редактировать критерии, чтобы задать их.",
    "actionsSettingsTable": {
      "rule": "Действие",
      "ruleTip": "Действие, выполненное при соблюдении критерия",
      "expression": "Выражение",
      "expressionTip": "Итоговое выражение в формате SQL, полученное по заданным критериям",
      "actions": "Критерии",
      "actionsTip": "Изменить порядок правил и задать условия запуска критерия"
    },
    "copyAction": {
      "description": "Источник значения поля обрабатывается, если активен, до переключения корректного критерия или завершения списка. Используйте кнопку Редактирования критерия, чтобы задать критерий.",
      "intersection": "Пересечение",
      "coordinates": "Координаты",
      "address": "Адрес",
      "preset": "Предустановленный",
      "actionText": "Действия",
      "criteriaText": "Критерии",
      "enableText": "Включено"
    },
    "actions": {
      "hide": "Скрыть",
      "required": "Необходимо",
      "disabled": "Отключено"
    }
  },
  "filterPage": {
    "submitHidden": "Отправить атрибутивные данные в это поле, даже если оно скрыто?",
    "title": "Настройка выражения для правила ${action}",
    "filterBuilder": "Задать действие с полем, когда запись соответствует ${any_or_all} из следующих выражений",
    "noFilterTip": "Используя указанные ниже инструменты, задайте выражение для выполняющегося действия."
  },
  "geocoderPage": {
    "setGeocoderURL": "Задать URL геокодера",
    "hintMsg": "Примечание: Вы изменяете сервис геокодирования, проверьте, что обновили сопоставление полей геокодера, которое вы настроили.",
    "invalidUrlTip": "URL ${URL} является недопустимым или недостижимым."
  },
  "addressPage": {
    "popupTitle": "Адрес",
    "checkboxLabel": "Задать значение из геокодера",
    "selectFieldTitle": "Атрибут:",
    "geocoderHint": "Для изменения геокодера перейдите к кнопке \"Настройки геокодера\" в общих настройках"
  },
  "coordinatesPage": {
    "popupTitle": "Координаты",
    "checkboxLabel": "Задать координаты",
    "coordinatesSelectTitle": "Система координат:",
    "coordinatesAttributeTitle": "Атрибут:",
    "mapSpatialReference": "Пространственная привязка карты",
    "latlong": "Широта/Долгота"
  },
  "presetPage": {
    "popupTitle": "Предустановленный",
    "checkboxLabel": "Поле будет предустановленным",
    "presetValueLabel": "Текущее предустановленное значение:",
    "changePresetValueHint": "Чтобы изменить это предустановленное значение перейдите к кнопке \"Задать предустановленные значения\" в общих настройках"
  },
  "intersectionPage": {
    "checkboxLabel": "Получить значение из поля слоя пересечения",
    "layerText": "Слои",
    "fieldText": "Поля",
    "actionsText": "Действия",
    "addLayerLinkText": "Добавить слой"
  },
  "presetAll": {
    "popupTitle": "Задать предустановленные значения по умолчанию",
    "deleteTitle": "Задать предустановленное значение",
    "hintMsg": "Все уникальные имена предустановленных полей перечислены здесь. Удаление предустановленного поля отключит соответствующее поле как предустановленное во всех слоях /таблицах."
  }
});