define({
  "page1": {
    "selectToolHeader": "बैच अपडेट करने के लिए रिकार्ड का चयन करने के लिए विधि का चयन करें।",
    "selectToolDesc": "विजेट अपडेट करने के लिए रिकॉर्ड का एक चयनित सेट उत्पन्न करने के लिए 3 विधियों का समर्थन करता है। आप विधियों में से एक का चयन कर सकते हैं। यदि आप को इन विधियों में से एक से अधिक की आवश्यकता है, तो एक नया विजेट बनाएं।",
    "selectByShape": "क्षेत्र द्वारा चयन करें",
    "selectBySpatQuery": "फीचर के द्वारा चयन करें",
    "selectByAttQuery": "फ़ीचर और संबंधित फीचर द्वारा चयन करें",
    "selectByQuery": "क्वेरी द्वारा चयन करें",
    "toolNotSelected": "कृपया एक चयन विधि का चयन करें"
  },
  "page2": {
    "layersToolHeader": "अपडेट करने के लिए लेयरस और चयन टूल्स विकल्प का चयन करें, यदि कोई हो।",
    "layersToolDesc": "चुनिंदा विधि जो आप ने एक पृष्ठ पर चयनित की है वह नीचे सूचीबद्ध लेयरस के सेट का चयन करने और उसे अपडेट करने के लिए इस्तेमाल की जाएगी। यदि आप एक से अधिक लेयर को चयनित करते हैं, तो केवल आम संशोधन योग्य फ़ील्ड अपडेट करने के लिए उपलब्ध होगी। चयन टूल की आपकी पसंद पर निर्भर करता है, कि किस अतिरिक्त विकल्प की आवश्यकता होगी।",
    "layerTable": {
      "colUpdate": "अपडेट करें",
      "colLabel": "लेयर",
      "colSelectByLayer": "लेयर द्वारा चयन करें",
      "colSelectByField": "क्वेरी फ़ील्ड",
      "colhighlightSymbol": "प्रतीक को हाइलाइट करें"
    },
    "toggleLayers": "खुलने और बंद होने पर टॉगल लेयर 'दृश्यता",
    "noEditableLayers": "संशोधन के लिए कोई लेयर नहीं है",
    "noLayersSelected": "आगे बढ़ने से पहले एक या अधिक लेयरों का चयन करें।"
  },
  "page3": {
    "commonFieldsHeader": "बैच अपडेट करने के लिए फ़ील्ड का चयन करें।",
    "commonFieldsDesc": "केवल आम संशोधन योग्य फ़ील्ड को नीचे दिखाया जाएगा। कृपया उन फ़ील्ड का चयन करें जिसे आप अपडेट करना चाहते हैं। यदि विभिन्न लेयरों से एक ही फ़ील्ड का एक अलग डोमेन है, तो केवल एक डोमेन प्रदर्शित और इस्तेमाल किया जाएगा।",
    "noCommonFields": "कोई आम फील्ड्स नहीं है",
    "fieldTable": {
      "colEdit": "संशोधन योग्य",
      "colName": "नाम",
      "colAlias": "उपनाम",
      "colAction": "कार्रवाइयाँ"
    }
  },
  "tabs": {
    "selection": "चयन प्रकार निर्धारित करें",
    "layers": "अपडेट की जाने वाली लेयरस निर्धारित करें",
    "fields": "अपडेट की जाने वाली फ़ील्ड निर्धारित करें"
  },
  "errorOnOk": "कॉन्फिग को सहेजने से पहले सभी पैरामीटरस भरें",
  "next": "अगला",
  "back": "पीछे जाएँ",
  "save": "चिन्ह को सहेजें",
  "cancel": "रद्द करें",
  "ok": "ठीक है",
  "symbolPopup": "चिन्ह चयनकर्ता"
});